000100                                                                  00010000
000200 01  2016-DATA-VALUES.                                            00020000
000300     05  2016-EFF-DATE             PIC X(08)  VALUE '20151001'.   00030000
000400     05  2016-HOSPICE-RATES.                                      00040000
000500         10  2016-RHC-LS-RATE      PIC 999V99 VALUE 111.23.       00050000
000600         10  2016-RHC-NLS-RATE     PIC 999V99 VALUE 050.66.       00060000
000700         10  2016-CHC-LS-RATE      PIC 999V99 VALUE 649.17.       00070000
000800         10  2016-CHC-NLS-RATE     PIC 999V99 VALUE 295.62.       00080000
000900         10  2016-IRC-LS-RATE      PIC 999V99 VALUE 090.64.       00090000
001000         10  2016-IRC-NLS-RATE     PIC 999V99 VALUE 076.81.       00100000
001100         10  2016-GIC-LS-RATE      PIC 999V99 VALUE 460.94.       00110000
001200         10  2016-GIC-NLS-RATE     PIC 999V99 VALUE 259.17.       00120000
001300                                                                  00130000
001400     05  2016-HOSPICE-RATES-Q.                                    00140000
001500         10  2016-RHC-LS-RATE-Q    PIC 999V99 VALUE 109.04.       00150000
001600         10  2016-RHC-NLS-RATE-Q   PIC 999V99 VALUE 049.66.       00160000
001700         10  2016-CHC-LS-RATE-Q    PIC 999V99 VALUE 636.39.       00170000
001800         10  2016-CHC-NLS-RATE-Q   PIC 999V99 VALUE 289.80.       00180000
001900         10  2016-IRC-LS-RATE-Q    PIC 999V99 VALUE 088.85.       00190000
002000         10  2016-IRC-NLS-RATE-Q   PIC 999V99 VALUE 075.30.       00200000
002100         10  2016-GIC-LS-RATE-Q    PIC 999V99 VALUE 451.87.       00210000
002200         10  2016-GIC-NLS-RATE-Q   PIC 999V99 VALUE 254.06.       00220000
002300                                                                  00230000
000100                                                                  00240000
000200 01  2016-DATA-VALUES.                                            00250000
000300     05  2016-EFF-DATE             PIC X(08)  VALUE '20151001'.   00260000
000400     05  2016-HOSPICE-RATES.                                      00270000
000500         10  2016-RHC-LS-RATE      PIC 999V99 VALUE 111.23.       00280000
000600         10  2016-RHC-NLS-RATE     PIC 999V99 VALUE 050.66.       00290000
000700         10  2016-CHC-LS-RATE      PIC 999V99 VALUE 649.17.       00300000
000800         10  2016-CHC-NLS-RATE     PIC 999V99 VALUE 295.62.       00310000
000900         10  2016-IRC-LS-RATE      PIC 999V99 VALUE 090.64.       00320000
001000         10  2016-IRC-NLS-RATE     PIC 999V99 VALUE 076.81.       00330000
001100         10  2016-GIC-LS-RATE      PIC 999V99 VALUE 460.94.       00340000
001200         10  2016-GIC-NLS-RATE     PIC 999V99 VALUE 259.17.       00350000
001300                                                                  00360000
001400     05  2016-HOSPICE-RATES-Q.                                    00370000
001500         10  2016-RHC-LS-RATE-Q    PIC 999V99 VALUE 109.04.       00380000
001600         10  2016-RHC-NLS-RATE-Q   PIC 999V99 VALUE 049.66.       00390000
001700         10  2016-CHC-LS-RATE-Q    PIC 999V99 VALUE 636.39.       00400000
001800         10  2016-CHC-NLS-RATE-Q   PIC 999V99 VALUE 289.80.       00410000
001900         10  2016-IRC-LS-RATE-Q    PIC 999V99 VALUE 088.85.       00420000
002000         10  2016-IRC-NLS-RATE-Q   PIC 999V99 VALUE 075.30.       00430000
002100         10  2016-GIC-LS-RATE-Q    PIC 999V99 VALUE 451.87.       00440000
002200         10  2016-GIC-NLS-RATE-Q   PIC 999V99 VALUE 254.06.       00450000
002300                                                                  00460000
