000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.           HOSPR160.                                  00020003
000300*AUTHOR.  BARBARA KUNKEL                                          00030000
000400*         (CENTERS FOR MEDICARE AND MEDICAID SERVICES)            00040000
000500*REMARKS. A). HOSPICE PRICER                                      00050000
000600******************************************************************00060000
000700*REMARKS.                                                         00070000
000800*     HOSPR160   REVISIONS FOR OCT 1, 2015                        00080003
000900*                REVISED PAYMENT RATES FOR FY2016                 00090003
000900*                MADE COPYBOOK (HOSPRATE) FOR PAYMENT RATES       00100007
001000*     HOSDR160   NEW PROCEESS OCT 1, 2015                         00110007
001100*                CBSA FILE PROCESSING DRIVER CALL HOSPR160        00120007
001200*     HOSOP160   NEW PROCEESS OCT 1, 2015                         00130007
001300*                CICS VERSION TO OPEN FILES CALL HOSDR160         00140007
001400*                                                                 00150007
001500*     HOSPR150   REVISIONS FOR OCT 1, 2014                        00160007
001600*                REVISED PAYMENT RATES FOR FY2015                 00170007
001700*     HOSDR150   NEW PROCEESS OCT 1, 2014                         00180007
001800*                CBSA FILE PROCESSING DRIVER CALL HOSPR150        00190007
001900*     HOSOP150   NEW PROCEESS OCT 1, 2014                         00200007
002000*                CICS VERSION TO OPEN FILES CALL HOSDR150         00210007
002100*                                                                 00220007
002200*     HOSPR140   REVISIONS FOR OCT 1, 2013                        00230007
002300*        ==>>>>  REVISED BILL & RATE RECORD LENGTH FROM 135 TO 25000240007
002400*        ==>>>>  NEW LOGIC FOR QIP INDICATOR                      00250007
002500*     HOSDR140   NEW PROCEESS OCT 1, 2013                         00260007
002600*                CBSA FILE PROCESSING DRIVER CALL HOSPR140        00270007
002700*     HOSOP140   NEW PROCEESS OCT 1, 2013                         00280007
002800*                CICS VERSION TO OPEN FILES CALL HOSDR140         00290007
002900*                                                                 00300007
003000*     HOSPR130   REVISIONS FOR OCT 1, 2012                        00310007
003100*                REVISED GO TO EXIT LOGIC FOR 2007, 7-1, 8 AND 9  00320007
003200*                        FOR 2007, 7-1, 8 AND 9                   00330007
003300*     HOSDR130   NEW PROCEESS OCT 1, 2012                         00340007
003400*                CBSA FILE PROCESSING DRIVER CALL HOSPR130        00350007
003500*     HOSOP130   NEW PROCEESS OCT 1, 2012                         00360007
003600*                CICS VERSION TO OPEN FILES CALL HOSDR130         00370007
003700*                                                                 00380007
003800*     HOSPR120   REVISIONS FOR OCT 1, 2011                        00390007
003900*                REVISED GO TO EXIT LOGIC FOR 2007, 7-1, 8 AND 9  00400007
004000*                        FOR 2007, 7-1, 8 AND 9                   00410007
004100*     HOSDR120   NEW PROCEESS OCT 1, 2011                         00420007
004200*                CBSA FILE PROCESSING DRIVER CALL HOSPR120        00430007
004300*     HOSOP120   NEW PROCEESS OCT 1, 2011                         00440007
004400*                CICS VERSION TO OPEN FILES CALL HOSDR120         00450007
004500*                                                                 00460007
004600*     HOSPR110   REVISIONS FOR OCT 1, 2010                        00470007
004700*                REVISED GO TO EXIT LOGIC FOR 2007, 7-1, 8 AND 9  00480007
004800*     HOSDR110   NEW PROCEESS OCT 1, 2010                         00490007
004900*                CBSA FILE PROCESSING DRIVER CALL HOSPR110        00500007
005000*     HOSOP110   NEW PROCEESS OCT 1, 2010                         00510007
005100*                CICS VERSION TO OPEN FILES CALL HOSDR110         00520007
005200*                                                                 00530007
005300*     HOSPR100   REVISIONS FOR OCT 1, 2009                        00540007
005400*                REVISED GO TO EXIT LOGIC FOR 2007, 7-1, 8 AND 9  00550007
005500*     HOSDR100   NEW PROCEESS OCT 1, 2009                         00560007
005600*                CBSA FILE PROCESSING DRIVER CALL HOSPR100        00570007
005700*     HOSOP100   NEW PROCEESS OCT 1, 2009                         00580007
005800*                CICS VERSION TO OPEN FILES CALL HOSDR100         00590007
005900*                                                                 00600007
006000*     HOSPR091   REVISIONS FOR OCT 1, 2008                        00610007
006100*                REVISED GO TO EXIT LOGIC FOR 2007, 7-1, 8 AND 9  00620007
006200*                STIMULUS PKG RECOMPILE                           00630007
006300*     HOSDR091   NEW PROCEESS OCT 1, 2008                         00640007
006400*                CBSA FILE PROCESSING DRIVER CALL HOSPR091        00650007
006500*     HOSOP091   NEW PROCEESS OCT 1, 2008                         00660007
006600*                CICS VERSION TO OPEN FILES CALL HOSDR091         00670007
006700*                                                                 00680007
006800*     HOSPR090   REVISIONS FOR OCT 1, 2008                        00690007
006900*                REVISED PAYMENT RATES FOR FY2009                 00700007
007000*     HOSDR090   NEW PROCEESS OCT 1, 2008                         00710007
007100*                CBSA FILE PROCESSING DRIVER CALL HOSPR090        00720007
007200*     HOSOP090   NEW PROCEESS OCT 1, 2008                         00730007
007300*                CICS VERSION TO OPEN FILES CALL HOSDR090         00740007
007400*                                                                 00750007
007500*     HOSPR081   REVISIONS FOR OCT 1, 2007                        00760007
007600*                REVISED PAYMENT RATES FOR FY2008                 00770007
007700*     HOSDR081   NEW PROCEESS OCT 1, 2007                         00780007
007800*                CBSA FILE PROCESSING DRIVER CALL HOSPR081        00790007
007900*     HOSOP081   NEW PROCEESS OCT 1, 2007                         00800007
008000*                CICS VERSION TO OPEN FILES CALL HOSDR081         00810007
008100*                                                                 00820007
008200*     HOSPR071   REVISIONS FOR JAN 1, 2007                        00830007
008300*                2007-CHANGE TO UNITS = 15 MINUTES CODE 652.      00840007
008400*     HOSDR071   NEW PROCEESS JAN 1, 2007                         00850007
008500*                CBSA FILE PROCESSING DRIVER CALL HOSPR071        00860007
008600*     HOSOP071   NEW PROCEESS JAN 1, 2007                         00870007
008700*                CICS VERSION TO OPEN FILES CALL HOSDR071         00880007
008800*                                                                 00890007
008900*     HOSPR070   REVISIONS FOR OCT 1, 2006                        00900007
009000*                2007-PROCESS-DATA                                00910007
009100*                2007 CALCULATE HOME RATE BY REVENUE CODE FACTORS 00920007
009200*     HOSDR070   NEW PROCEESS OCT 1, 2006                         00930007
009300*                CBSA FILE PROCESSING DRIVER                      00940007
009400*     HOSOP070   NEW PROCEESS OCT 1, 2006                         00950007
009500*                CICS VERSION TO OPEN FILES                       00960007
009600*                                                                 00970007
009700***************************************************************   00980007
009800******************************************************************00990007
009900***     WILL PROCESS CLAIMS  FOR 1998 THRU 2007                   01000007
010000***                ALL RATES FOR 1998 THRU 2007                   01010007
010100******************************************************************01020007
010200 DATE-COMPILED.                                                   01030007
010300 ENVIRONMENT DIVISION.                                            01040007
010400 CONFIGURATION SECTION.                                           01050007
010500 SOURCE-COMPUTER.            IBM-370.                             01060000
010600 OBJECT-COMPUTER.            IBM-370.                             01070000
010700 INPUT-OUTPUT  SECTION.                                           01080000
010800 FILE-CONTROL.                                                    01090003
010900                                                                  01100003
011000                                                                  01110003
011100 DATA DIVISION.                                                   01120000
011200 FILE SECTION.                                                    01130000
011300                                                                  01140000
011400                                                                  01150000
011500 WORKING-STORAGE SECTION.                                         01160000
011600 01  W-STORAGE-REF                  PIC X(46)  VALUE              01170000
011700     'HOSPR160      - W O R K I N G   S T O R A G E'.             01180003
011800 01  HOS-VERSION                    PIC X(09)  VALUE 'HOSPR16.0'. 01190004
011900 01  WRK-PAY-RATE1                  PIC 9(06)V9(02) VALUE 0.      01200000
012000 01  WRK-PAY-RATE2                  PIC 9(06)V9(02) VALUE 0.      01210000
012100 01  WRK-PAY-RATE3                  PIC 9(06)V9(02) VALUE 0.      01220000
012200 01  WRK-PAY-RATE4                  PIC 9(06)V9(02) VALUE 0.      01230000
012300                                                                  01240000
012400 COPY HOSPRATE.                                                   01250003
012500                                                                  01260000
014700                                                                  01270003
014800                                                                  01280000
014900 LINKAGE SECTION.                                                 01290000
015000***************************************************************   01300000
015100*                 * * * * * * * * *                           *   01310000
015200***************************************************************   01320000
015300***************************************************************   01330000
015400*    THIS DATA IS CALCULATED BY THIS HOSPRICER PROGRAM        *   01340000
015500*    AND PASSED BACK                                          *   01350000
015600*            RETURN CODE VALUES (HLD-RTC)                     *   01360000
015700*                                                             *   01370000
015800*            HLD-RTC                                          *   01380000
015900*              00 = HOME RATE RETURNED                        *   01390000
016000*                                                             *   01400000
016100*            HLD-RTC   NO RATE RETURNED                       *   01410000
016200*              10 = BAD UNITS                                 *   01420000
016300*                                                             *   01430000
016400*              20 = BAD UNITS2 < 8                            *   01440000
016500*                                                             *   01450000
016600*              30 = BAD MSA CODE                              *   01460000
016700*                                                             *   01470000
016800*              40 = BAD HOSPICE WAGE INDEX FROM MSAFILE       *   01480000
016900*                                                             *   01490000
017000*              50 = BAD BENE    WAGE INDEX FROM MSAFILE       *   01500000
017100*                                                             *   01510000
017200*              51 = BAD PROV NUMBER                           *   01520000
017300*                                                             *   01530000
017400***************************************************************   01540000
017500                                                                  01550003
017600***************************************************************   01560000
017700 01  HOLD-BILL-DATA.                                              01570003
017800     10  HLD-NPI                  PIC X(10).                      01580003
017900     10  HLD-PROV-NO              PIC X(06).                      01590003
018000     10  HLD-FROM-DATE-ALL.                                       01600003
018100         15  HLD-FROM-CC          PIC 99.                         01610003
018200         15  HLD-FROM-DATE.                                       01620003
018300             20  HLD-FROM-YY      PIC 99.                         01630003
018400             20  HLD-FROM-MM      PIC 99.                         01640003
018500             20  HLD-FROM-DD      PIC 99.                         01650003
018600*                                                                 01660003
018700     10  FILLER                   PIC X(08).                      01670003
018800*                                                                 01680003
018900     10  HLD-PROV-MSA-LUGAR.                                      01690003
019000         15  HLD-PROV-MSA         PIC X(04).                      01700003
019100         15  HLD-PROV-LUGAR       PIC X.                          01710003
019200     10  HLD-PROV-CBSA REDEFINES                                  01720003
019300                       HLD-PROV-MSA-LUGAR PIC X(05).              01730003
019400*                                                                 01740003
019500     10  HLD-BENE-MSA-LUGAR.                                      01750003
019600         15  HLD-BENE-MSA         PIC X(04).                      01760003
019700         15  HLD-BENE-LUGAR       PIC X.                          01770003
019800     10  HLD-BENE-CBSA REDEFINES                                  01780003
019900                       HLD-BENE-MSA-LUGAR PIC X(05).              01790003
020000*                                                                 01800003
020100     10  FILLER                   PIC X(10).                      01810003
020200*                                                                 01820003
020300     10  HLD-PROV-WAGE-IND        PIC 9(02)V9(04).                01830003
020400     10  HLD-BENE-WAGE-IND        PIC 9(02)V9(04).                01840003
020500*                                                                 01850003
020600     10  FILLER                   PIC X(20).                      01860003
020700*                                                                 01870003
020800     10  HLD-QIP-REDUCTION-IND    PIC X.                          01880003
020900*                                                                 01890003
021000     10  HLD-GROUP1.                                              01900003
021100         15  HLD-REV1             PIC XXXX.                       01910003
021200         15  HLD-HCPC1            PIC X(05).                      01920003
021300         15  HLD-UNITS1           PIC 9(07).                      01930003
021400         15  HLD-THEIR-PAY-CHG1   PIC 9(06)V99.                   01940003
021500     10  HLD-GROUP2.                                              01950003
021600         15  HLD-REV2             PIC XXXX.                       01960003
021700         15  HLD-HCPC2            PIC X(05).                      01970003
021800         15  HLD-UNITS2           PIC 9(07).                      01980003
021900         15  HLD-THEIR-PAY-CHG2   PIC 9(06)V99.                   01990003
022000     10  HLD-GROUP3.                                              02000003
022100         15  HLD-REV3             PIC XXXX.                       02010003
022200         15  HLD-HCPC3            PIC X(05).                      02020003
022300         15  HLD-UNITS3           PIC 9(07).                      02030003
022400         15  HLD-THEIR-PAY-CHG3   PIC 9(06)V99.                   02040003
022500     10  HLD-GROUP4.                                              02050003
022600         15  HLD-REV4             PIC XXXX.                       02060003
022700         15  HLD-HCPC4            PIC X(05).                      02070003
022800         15  HLD-UNITS4           PIC 9(07).                      02080003
022900         15  HLD-THEIR-PAY-CHG4   PIC 9(06)V99.                   02090003
023000     10  HLD-RETURNED-DATA.                                       02100003
023100         15  HLD-PAY-AMT          PIC 9(06)V99.                   02110003
023200         15  HLD-RTC              PIC XX.                         02120003
023300     10  FILLER                   PIC X(24).                      02130003
023400                                                                  02140003
025500                                                                  02150003
025600***************************************************************   02160003
025700*----------------------------------------------------------****   02170000
025800 PROCEDURE DIVISION USING HOLD-BILL-DATA.                         02180000
025900***************************************************************   02190000
026000*----------------------------------------------------------****   02200000
026100                                                                  02210000
026200     MOVE ALL '0'              TO HLD-RETURNED-DATA               02220000
026300                                  HLD-THEIR-PAY-CHG1              02230000
026400                                  HLD-THEIR-PAY-CHG2              02240000
026500                                  HLD-THEIR-PAY-CHG3              02250000
026600                                  HLD-THEIR-PAY-CHG4.             02260000
026700                                                                  02270000
026800*----------------------------------------------------------****   02280000
026900*  FY 2016 PROCESS                                                02290001
027000*----------------------------------------------------------****   02300000
027100                                                                  02310000
027200     IF HLD-FROM-DATE-ALL > 20150930                              02320001
027300        PERFORM 2016-PROCESS-DATA                                 02330001
027400           THRU 2016-EXIT                                         02340001
027500        GOBACK.                                                   02350000
027600                                                                  02360000
027700                                                                  02370000
027800*----------------------------------------------------------****   02380000
027900*  FY 2015 PROCESS                                                02390001
028000*----------------------------------------------------------****   02400000
028100                                                                  02410000
028200     IF HLD-FROM-DATE-ALL > 20140930                              02420001
028300        PERFORM 2015-PROCESS-DATA                                 02430001
028400           THRU 2015-EXIT                                         02440001
028500        GOBACK.                                                   02450000
028600                                                                  02460000
028700                                                                  02470000
028800*----------------------------------------------------------****   02480000
028900*  FY 2014 PROCESS                                                02490001
029000*----------------------------------------------------------****   02500000
029100                                                                  02510000
029200     IF HLD-FROM-DATE-ALL > 20130930                              02520001
029300        PERFORM 2014-PROCESS-DATA                                 02530001
029400           THRU 2014-EXIT                                         02540001
029500        GOBACK.                                                   02550000
029600                                                                  02560000
029700*----------------------------------------------------------****   02570000
029800*  FY 2013 PROCESS                                                02580001
029900*----------------------------------------------------------****   02590000
030000                                                                  02600000
030100     IF HLD-FROM-DATE-ALL > 20120930                              02610001
030200        PERFORM 2013-PROCESS-DATA                                 02620001
030300           THRU 2013-EXIT                                         02630001
030400        GOBACK.                                                   02640000
030500                                                                  02650000
030600*----------------------------------------------------------****   02660000
030700*  FY 2012 PROCESS                                                02670001
030800*----------------------------------------------------------****   02680000
030900                                                                  02690000
031000     IF HLD-FROM-DATE-ALL > 20110930                              02700001
031100        PERFORM 2012-PROCESS-DATA                                 02710001
031200           THRU 2012-EXIT                                         02720001
031300        GOBACK.                                                   02730000
031400                                                                  02740000
031500*----------------------------------------------------------****   02750000
031600*  FY 2011 PROCESS                                                02760001
031700*----------------------------------------------------------****   02770000
031800                                                                  02780000
031900     IF HLD-FROM-DATE-ALL > 20100930                              02790001
032000        PERFORM 2011-PROCESS-DATA                                 02800001
032100           THRU 2011-EXIT                                         02810001
032200        GOBACK.                                                   02820000
032300                                                                  02830000
032400*----------------------------------------------------------****   02840000
032500*  FY 2010 PROCESS                                                02850001
032600*----------------------------------------------------------****   02860000
032700                                                                  02870000
032800     IF HLD-FROM-DATE-ALL > 20090930                              02880001
032900        PERFORM 2010-PROCESS-DATA                                 02890001
033000           THRU 2010-EXIT                                         02900001
033100        GOBACK.                                                   02910000
033200                                                                  02920000
033300*----------------------------------------------------------****   02930000
033400*  FY 2009 PROCESS                                                02940001
033500*----------------------------------------------------------****   02950000
033600                                                                  02960000
033700     IF HLD-FROM-DATE-ALL > 20080930                              02970001
033800        PERFORM 2009-PROCESS-DATA                                 02980001
033900           THRU 2009-EXIT                                         02990001
034000        GOBACK.                                                   03000000
034100                                                                  03010000
034200*----------------------------------------------------------****   03020001
034300*  FY 2008 PROCESS                                                03030001
034400*----------------------------------------------------------****   03040001
034500                                                                  03050001
034600     IF HLD-FROM-DATE-ALL > 20070930                              03060001
034700        PERFORM 2008-PROCESS-DATA                                 03070001
034800           THRU 2008-EXIT                                         03080001
034900        GOBACK.                                                   03090001
035000                                                                  03100001
035100*----------------------------------------------------------****   03110000
035200*  FY 2007.1 PROCESS                                              03120000
035300*----------------------------------------------------------****   03130000
035400                                                                  03140000
035500     IF HLD-FROM-DATE-ALL > 20061231                              03150000
035600        PERFORM 2007-1-PROCESS-DATA                               03160000
035700           THRU 2007-1-EXIT                                       03170001
035800        GOBACK.                                                   03180000
035900                                                                  03190000
036000*----------------------------------------------------------****   03200000
036100*  FY 2007 PROCESS                                                03210000
036200*----------------------------------------------------------****   03220000
036300                                                                  03230000
036400     IF HLD-FROM-DATE-ALL > 20060930                              03240000
036500        PERFORM 2007-PROCESS-DATA                                 03250000
036600           THRU 2007-EXIT                                         03260001
036700        GOBACK.                                                   03270000
036800                                                                  03280000
036900*----------------------------------------------------------****   03290000
037000*  FY 2006 PROCESS                                                03300000
037100*----------------------------------------------------------****   03310000
037200                                                                  03320000
037300     IF HLD-FROM-DATE-ALL > 20050930                              03330000
037400        PERFORM 2006-PROCESS-DATA                                 03340000
037500           THRU 2006-EXIT                                         03350001
037600        GOBACK.                                                   03360000
037700                                                                  03370000
037800*----------------------------------------------------------****   03380000
037900*  FY 2005 PROCESS                                                03390000
038000*----------------------------------------------------------****   03400000
038100                                                                  03410000
038200     IF HLD-FROM-DATE-ALL > 20040930                              03420000
038300        PERFORM 2005-PROCESS-DATA                                 03430000
038400           THRU 2005-EXIT                                         03440001
038500        GOBACK.                                                   03450000
038600                                                                  03460000
038700*----------------------------------------------------------****   03470000
038800*  FY 2004 PROCESS                                                03480000
038900*----------------------------------------------------------****   03490000
039000                                                                  03500000
039100     IF HLD-FROM-DATE-ALL > 20030930                              03510000
039200        PERFORM 2004-PROCESS-DATA                                 03520000
039300           THRU 2004-EXIT                                         03530001
039400        GOBACK.                                                   03540000
039500                                                                  03550000
039600*----------------------------------------------------------****   03560000
039700*  FY 2003 PROCESS                                                03570000
039800*----------------------------------------------------------****   03580000
039900                                                                  03590000
040000     IF HLD-FROM-DATE-ALL > 20020930                              03600000
040100        PERFORM 2003-PROCESS-DATA                                 03610000
040200           THRU 2003-EXIT                                         03620001
040300        GOBACK.                                                   03630000
040400                                                                  03640000
040500*----------------------------------------------------------****   03650000
040600*  FY 2002 PROCESS                                                03660000
040700*----------------------------------------------------------****   03670000
040800                                                                  03680000
040900     IF HLD-FROM-DATE-ALL > 20010930                              03690000
041000        PERFORM 2002-PROCESS-DATA                                 03700000
041100           THRU 2002-EXIT                                         03710001
041200        GOBACK.                                                   03720000
041300                                                                  03730000
041400*----------------------------------------------------------****   03740000
041500*  FY 2001-A PROCESS                                              03750000
041600*----------------------------------------------------------****   03760000
041700                                                                  03770000
041800     IF HLD-FROM-DATE-ALL > 20010331                              03780000
041900        PERFORM 2001A-PROCESS-DATA                                03790000
042000           THRU 2001A-EXIT                                        03800001
042100        GOBACK.                                                   03810000
042200                                                                  03820000
042300*----------------------------------------------------------****   03830000
042400*  FY 2001 PROCESS                                                03840000
042500*----------------------------------------------------------****   03850000
042600                                                                  03860000
042700     IF HLD-FROM-DATE-ALL > 20000930                              03870000
042800        PERFORM 2001-PROCESS-DATA                                 03880000
042900           THRU 2001-EXIT                                         03890001
043000        GOBACK.                                                   03900000
043100                                                                  03910000
043200*----------------------------------------------------------****   03920000
043300*  FY 2000 PROCESS                                                03930000
043400*----------------------------------------------------------****   03940000
043500                                                                  03950000
043600     IF HLD-FROM-DATE-ALL > 19990930                              03960000
043700        PERFORM 2000-PROCESS-DATA                                 03970000
043800           THRU 2000-EXIT                                         03980001
043900        GOBACK.                                                   03990000
044000                                                                  04000000
044100*----------------------------------------------------------****   04010000
044200*  FY 1999 PROCESS                                                04020000
044300*----------------------------------------------------------****   04030000
044400                                                                  04040000
044500     IF HLD-FROM-DATE-ALL > 19980930                              04050000
044600        PERFORM 1999-PROCESS-DATA                                 04060000
044700           THRU 1999-EXIT                                         04070001
044800        GOBACK.                                                   04080000
044900                                                                  04090000
045000*----------------------------------------------------------****   04100000
045100*  FY 1998 PROCESS                                                04110000
045200*----------------------------------------------------------****   04120000
045300                                                                  04130000
045400     PERFORM 1998-PROCESS-DATA                                    04140000
045500        THRU 1998-EXIT                                            04150001
045600                                                                  04160000
045700     GOBACK.                                                      04170000
045800                                                                  04180000
045900*----------------------------------------------------------****   04190000
046000*  FY 1998 PROCESS                                                04200000
046100*----------------------------------------------------------****   04210000
046200                                                                  04220000
046300 1998-PROCESS-DATA.                                               04230000
046400                                                                  04240000
046500     IF HLD-UNITS1 > 1000 OR                                      04250000
046600        HLD-UNITS2 > 1000 OR                                      04260000
046700        HLD-UNITS3 > 1000 OR                                      04270000
046800        HLD-UNITS4 > 1000                                         04280000
046900        MOVE '10'              TO HLD-RTC                         04290000
047000        GO TO 1998-EXIT.                                          04300000
047100                                                                  04310000
047200     IF HLD-REV2  = '0652'                                        04320000
047300        IF HLD-UNITS2 < 8                                         04330000
047400           MOVE '20'           TO HLD-RTC                         04340000
047500           GO TO 1998-EXIT.                                       04350000
047600                                                                  04360000
047700****    CALCULATE HOME RATE BY REVENUE CODE                       04370000
047800****    CALCULATE HOME RATE BY REVENUE CODE                       04380000
047900                                                                  04390000
048000     IF HLD-REV1  = '0651'                                        04400000
048100        COMPUTE WRK-PAY-RATE1 ROUNDED =                           04410000
048200         ((65.80 * HLD-BENE-WAGE-IND) + 29.97) * HLD-UNITS1.      04420000
048300                                                                  04430000
048400     IF HLD-REV2  = '0652'                                        04440000
048500        COMPUTE WRK-PAY-RATE2 ROUNDED =                           04450000
048600         (((384.08 * HLD-BENE-WAGE-IND)                           04460000
048700                                   + 174.91) / 24) * HLD-UNITS2.  04470000
048800                                                                  04480000
048900     IF HLD-REV3  = '0655'                                        04490000
049000        COMPUTE WRK-PAY-RATE3 ROUNDED =                           04500000
049100         ((53.63 * HLD-PROV-WAGE-IND) + 45.44) * HLD-UNITS3.      04510000
049200                                                                  04520000
049300     IF HLD-REV4  = '0656'                                        04530000
049400        COMPUTE WRK-PAY-RATE4 ROUNDED =                           04540000
049500         ((272.71 * HLD-PROV-WAGE-IND) + 153.34) * HLD-UNITS4.    04550000
049600                                                                  04560000
049700     COMPUTE HLD-PAY-AMT =                                        04570000
049800             WRK-PAY-RATE1 +                                      04580000
049900             WRK-PAY-RATE2 +                                      04590000
050000             WRK-PAY-RATE3 +                                      04600000
050100             WRK-PAY-RATE4.                                       04610000
050200                                                                  04620000
050300     MOVE WRK-PAY-RATE1        TO HLD-THEIR-PAY-CHG1.             04630000
050400     MOVE WRK-PAY-RATE2        TO HLD-THEIR-PAY-CHG2.             04640000
050500     MOVE WRK-PAY-RATE3        TO HLD-THEIR-PAY-CHG3.             04650000
050600     MOVE WRK-PAY-RATE4        TO HLD-THEIR-PAY-CHG4.             04660000
050700                                                                  04670000
050800     MOVE ZEROES               TO WRK-PAY-RATE1                   04680000
050900                                  WRK-PAY-RATE2                   04690000
051000                                  WRK-PAY-RATE3                   04700000
051100                                  WRK-PAY-RATE4.                  04710000
051200                                                                  04720000
051300 1998-EXIT.  EXIT.                                                04730000
051400                                                                  04740000
051500*----------------------------------------------------------****   04750000
051600*  FY 1999 PROCESS                                                04760000
051700*----------------------------------------------------------****   04770000
051800                                                                  04780000
051900 1999-PROCESS-DATA.                                               04790000
052000     IF HLD-UNITS1 > 1000 OR                                      04800000
052100        HLD-UNITS2 > 1000 OR                                      04810000
052200        HLD-UNITS3 > 1000 OR                                      04820000
052300        HLD-UNITS4 > 1000                                         04830000
052400        MOVE '10'              TO HLD-RTC                         04840000
052500        GO TO 1999-EXIT.                                          04850000
052600                                                                  04860000
052700     IF HLD-REV2  = '0652'                                        04870000
052800        IF HLD-UNITS2 < 8                                         04880000
052900           MOVE '20'           TO HLD-RTC                         04890000
053000           GO TO 1999-EXIT.                                       04900000
053100                                                                  04910000
053200****    CALCULATE HOME RATE BY REVENUE CODE                       04920000
053300****    CALCULATE HOME RATE BY REVENUE CODE                       04930000
053400                                                                  04940000
053500     IF HLD-REV1  = '0651'                                        04950000
053600        COMPUTE WRK-PAY-RATE1 ROUNDED =                           04960000
053700         ((66.72 * HLD-BENE-WAGE-IND) + 30.39) * HLD-UNITS1.      04970000
053800                                                                  04980000
053900     IF HLD-REV2  = '0652'                                        04990000
054000        COMPUTE WRK-PAY-RATE2 ROUNDED =                           05000000
054100         (((389.46 * HLD-BENE-WAGE-IND)                           05010000
054200                                   + 177.36) / 24) * HLD-UNITS2.  05020000
054300                                                                  05030000
054400     IF HLD-REV3  = '0655'                                        05040000
054500        COMPUTE WRK-PAY-RATE3 ROUNDED =                           05050000
054600         ((54.38 * HLD-PROV-WAGE-IND) + 46.08) * HLD-UNITS3.      05060000
054700                                                                  05070000
054800     IF HLD-REV4  = '0656'                                        05080000
054900        COMPUTE WRK-PAY-RATE4 ROUNDED =                           05090000
055000         ((276.53 * HLD-PROV-WAGE-IND) + 155.48) * HLD-UNITS4.    05100000
055100                                                                  05110000
055200     COMPUTE HLD-PAY-AMT =                                        05120000
055300             WRK-PAY-RATE1 +                                      05130000
055400             WRK-PAY-RATE2 +                                      05140000
055500             WRK-PAY-RATE3 +                                      05150000
055600             WRK-PAY-RATE4.                                       05160000
055700                                                                  05170000
055800     MOVE WRK-PAY-RATE1        TO HLD-THEIR-PAY-CHG1.             05180000
055900     MOVE WRK-PAY-RATE2        TO HLD-THEIR-PAY-CHG2.             05190000
056000     MOVE WRK-PAY-RATE3        TO HLD-THEIR-PAY-CHG3.             05200000
056100     MOVE WRK-PAY-RATE4        TO HLD-THEIR-PAY-CHG4.             05210000
056200                                                                  05220000
056300                                                                  05230000
056400     MOVE ZEROES               TO WRK-PAY-RATE1                   05240000
056500                                  WRK-PAY-RATE2                   05250000
056600                                  WRK-PAY-RATE3                   05260000
056700                                  WRK-PAY-RATE4.                  05270000
056800                                                                  05280000
056900 1999-EXIT.  EXIT.                                                05290000
057000                                                                  05300000
057100*----------------------------------------------------------****   05310000
057200*  FY 2000 PROCESS                                                05320000
057300*----------------------------------------------------------****   05330000
057400                                                                  05340000
057500 2000-PROCESS-DATA.                                               05350000
057600     IF HLD-UNITS1 > 1000 OR                                      05360000
057700        HLD-UNITS2 > 1000 OR                                      05370000
057800        HLD-UNITS3 > 1000 OR                                      05380000
057900        HLD-UNITS4 > 1000                                         05390000
058000        MOVE '10'              TO HLD-RTC                         05400000
058100        GO TO 2000-EXIT.                                          05410000
058200                                                                  05420000
058300     IF HLD-REV2  = '0652'                                        05430000
058400        IF HLD-UNITS2 < 8                                         05440000
058500           MOVE '20'           TO HLD-RTC                         05450000
058600           GO TO 2000-EXIT.                                       05460000
058700                                                                  05470000
058800****    CALCULATE HOME RATE BY REVENUE CODE                       05480000
058900****    CALCULATE HOME RATE BY REVENUE CODE                       05490000
059000                                                                  05500000
059100     IF HLD-REV1  = '0651'                                        05510000
059200        COMPUTE WRK-PAY-RATE1 ROUNDED =                           05520000
059300         ((68.00 * HLD-BENE-WAGE-IND) + 30.96) * HLD-UNITS1.      05530000
059400                                                                  05540000
059500     IF HLD-REV2  = '0652'                                        05550000
059600        COMPUTE WRK-PAY-RATE2 ROUNDED =                           05560000
059700         (((396.86 * HLD-BENE-WAGE-IND)                           05570000
059800                                   + 180.73) / 24) * HLD-UNITS2.  05580000
059900                                                                  05590000
060000     IF HLD-REV3  = '0655'                                        05600000
060100        COMPUTE WRK-PAY-RATE3 ROUNDED =                           05610000
060200         ((55.41 * HLD-PROV-WAGE-IND) + 46.96) * HLD-UNITS3.      05620000
060300                                                                  05630000
060400     IF HLD-REV4  = '0656'                                        05640000
060500        COMPUTE WRK-PAY-RATE4 ROUNDED =                           05650000
060600         ((281.78 * HLD-PROV-WAGE-IND) + 158.44) * HLD-UNITS4.    05660000
060700                                                                  05670000
060800     COMPUTE HLD-PAY-AMT =                                        05680000
060900             WRK-PAY-RATE1 +                                      05690000
061000             WRK-PAY-RATE2 +                                      05700000
061100             WRK-PAY-RATE3 +                                      05710000
061200             WRK-PAY-RATE4.                                       05720000
061300                                                                  05730000
061400     MOVE WRK-PAY-RATE1        TO HLD-THEIR-PAY-CHG1.             05740000
061500     MOVE WRK-PAY-RATE2        TO HLD-THEIR-PAY-CHG2.             05750000
061600     MOVE WRK-PAY-RATE3        TO HLD-THEIR-PAY-CHG3.             05760000
061700     MOVE WRK-PAY-RATE4        TO HLD-THEIR-PAY-CHG4.             05770000
061800                                                                  05780000
061900                                                                  05790000
062000     MOVE ZEROES               TO WRK-PAY-RATE1                   05800000
062100                                  WRK-PAY-RATE2                   05810000
062200                                  WRK-PAY-RATE3                   05820000
062300                                  WRK-PAY-RATE4.                  05830000
062400                                                                  05840000
062500 2000-EXIT.  EXIT.                                                05850000
062600                                                                  05860000
062700*----------------------------------------------------------****   05870000
062800*  FY 2001 PROCESS                                                05880000
062900*----------------------------------------------------------****   05890000
063000                                                                  05900000
063100 2001-PROCESS-DATA.                                               05910000
063200     IF HLD-UNITS1 > 1000 OR                                      05920000
063300        HLD-UNITS2 > 1000 OR                                      05930000
063400        HLD-UNITS3 > 1000 OR                                      05940000
063500        HLD-UNITS4 > 1000                                         05950000
063600        MOVE '10' TO HLD-RTC                                      05960000
063700        GO TO 2001-EXIT.                                          05970000
063800                                                                  05980000
063900     IF HLD-REV2  = '0652'                                        05990000
064000        IF HLD-UNITS2 < 8                                         06000000
064100           MOVE '20' TO HLD-RTC                                   06010000
064200           GO TO 2001-EXIT.                                       06020000
064300                                                                  06030000
064400****    CALCULATE HOME RATE BY REVENUE CODE                       06040000
064500****    CALCULATE HOME RATE BY REVENUE CODE                       06050000
064600                                                                  06060000
064700     IF HLD-REV1  = '0651'                                        06070000
064800        COMPUTE WRK-PAY-RATE1 ROUNDED =                           06080000
064900         ((69.97 * HLD-BENE-WAGE-IND) + 31.87) * HLD-UNITS1.      06090000
065000                                                                  06100000
065100     IF HLD-REV2  = '0652'                                        06110000
065200        COMPUTE WRK-PAY-RATE2 ROUNDED =                           06120000
065300         (((408.42 * HLD-BENE-WAGE-IND)                           06130000
065400                                   + 185.99) / 24) * HLD-UNITS2.  06140000
065500                                                                  06150000
065600     IF HLD-REV3  = '0655'                                        06160000
065700        COMPUTE WRK-PAY-RATE3 ROUNDED =                           06170000
065800         ((57.03 * HLD-PROV-WAGE-IND) + 48.32) * HLD-UNITS3.      06180000
065900                                                                  06190000
066000     IF HLD-REV4  = '0656'                                        06200000
066100        COMPUTE WRK-PAY-RATE4 ROUNDED =                           06210000
066200         ((289.99 * HLD-PROV-WAGE-IND) + 163.05) * HLD-UNITS4.    06220000
066300                                                                  06230000
066400     COMPUTE HLD-PAY-AMT =                                        06240000
066500             WRK-PAY-RATE1 +                                      06250000
066600             WRK-PAY-RATE2 +                                      06260000
066700             WRK-PAY-RATE3 +                                      06270000
066800             WRK-PAY-RATE4.                                       06280000
066900                                                                  06290000
067000     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   06300000
067100     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   06310000
067200     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   06320000
067300     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   06330000
067400                                                                  06340000
067500                                                                  06350000
067600     MOVE ZEROES TO WRK-PAY-RATE1                                 06360000
067700                     WRK-PAY-RATE2                                06370000
067800                     WRK-PAY-RATE3                                06380000
067900                     WRK-PAY-RATE4.                               06390000
068000                                                                  06400000
068100 2001-EXIT.  EXIT.                                                06410000
068200                                                                  06420000
068300*----------------------------------------------------------****   06430000
068400*  FY 2001-A PROCESS                                              06440000
068500*----------------------------------------------------------****   06450000
068600                                                                  06460000
068700 2001A-PROCESS-DATA.                                              06470000
068800     IF HLD-UNITS1 > 1000 OR                                      06480000
068900        HLD-UNITS2 > 1000 OR                                      06490000
069000        HLD-UNITS3 > 1000 OR                                      06500000
069100        HLD-UNITS4 > 1000                                         06510000
069200        MOVE '10' TO HLD-RTC                                      06520000
069300        GO TO 2001A-EXIT.                                         06530000
069400                                                                  06540000
069500     IF HLD-REV2  = '0652'                                        06550000
069600        IF HLD-UNITS2 < 8                                         06560000
069700           MOVE '20' TO HLD-RTC                                   06570000
069800           GO TO 2001A-EXIT.                                      06580000
069900                                                                  06590000
070000****    CALCULATE HOME RATE BY REVENUE CODE                       06600000
070100****    CALCULATE HOME RATE BY REVENUE CODE                       06610000
070200                                                                  06620000
070300     IF HLD-REV1  = '0651'                                        06630000
070400        COMPUTE WRK-PAY-RATE1 ROUNDED =                           06640000
070500         ((73.47 * HLD-BENE-WAGE-IND) + 33.46) * HLD-UNITS1.      06650000
070600                                                                  06660000
070700     IF HLD-REV2  = '0652'                                        06670000
070800        COMPUTE WRK-PAY-RATE2 ROUNDED =                           06680000
070900         (((428.84 * HLD-BENE-WAGE-IND)                           06690000
071000                                   + 195.29) / 24) * HLD-UNITS2.  06700000
071100                                                                  06710000
071200     IF HLD-REV3  = '0655'                                        06720000
071300        COMPUTE WRK-PAY-RATE3 ROUNDED =                           06730000
071400         ((59.88 * HLD-PROV-WAGE-IND) + 50.74) * HLD-UNITS3.      06740000
071500                                                                  06750000
071600     IF HLD-REV4  = '0656'                                        06760000
071700        COMPUTE WRK-PAY-RATE4 ROUNDED =                           06770000
071800         ((304.49 * HLD-PROV-WAGE-IND) + 171.20) * HLD-UNITS4.    06780000
071900                                                                  06790000
072000     COMPUTE HLD-PAY-AMT =                                        06800000
072100             WRK-PAY-RATE1 +                                      06810000
072200             WRK-PAY-RATE2 +                                      06820000
072300             WRK-PAY-RATE3 +                                      06830000
072400             WRK-PAY-RATE4.                                       06840000
072500                                                                  06850000
072600     MOVE WRK-PAY-RATE1       TO  HLD-THEIR-PAY-CHG1.             06860003
072700     MOVE WRK-PAY-RATE2       TO  HLD-THEIR-PAY-CHG2.             06870003
072800     MOVE WRK-PAY-RATE3       TO  HLD-THEIR-PAY-CHG3.             06880003
072900     MOVE WRK-PAY-RATE4       TO  HLD-THEIR-PAY-CHG4.             06890003
073000                                                                  06900000
073100                                                                  06910000
073200     MOVE ZEROES TO WRK-PAY-RATE1                                 06920000
073300                     WRK-PAY-RATE2                                06930000
073400                     WRK-PAY-RATE3                                06940000
073500                     WRK-PAY-RATE4.                               06950000
073600                                                                  06960000
073700 2001A-EXIT.  EXIT.                                               06970000
073800                                                                  06980000
073900*----------------------------------------------------------****   06990000
074000*  FY 2002 PROCESS                                                07000000
074100*----------------------------------------------------------****   07010000
074200                                                                  07020000
074300 2002-PROCESS-DATA.                                               07030000
074400     IF HLD-UNITS1 > 1000 OR                                      07040000
074500        HLD-UNITS2 > 1000 OR                                      07050000
074600        HLD-UNITS3 > 1000 OR                                      07060000
074700        HLD-UNITS4 > 1000                                         07070000
074800        MOVE '10' TO HLD-RTC                                      07080000
074900        GO TO 2002-EXIT.                                          07090000
075000                                                                  07100000
075100     IF HLD-REV2  = '0652'                                        07110000
075200        IF HLD-UNITS2 < 8                                         07120000
075300           MOVE '20' TO HLD-RTC                                   07130000
075400           GO TO 2002-EXIT.                                       07140000
075500                                                                  07150000
075600****    CALCULATE HOME RATE BY REVENUE CODE                       07160000
075700****    CALCULATE HOME RATE BY REVENUE CODE                       07170000
075800                                                                  07180000
075900     IF HLD-REV1  = '0651'                                        07190000
076000        COMPUTE WRK-PAY-RATE1 ROUNDED =                           07200000
076100         ((75.87 * HLD-BENE-WAGE-IND) + 34.55) * HLD-UNITS1.      07210000
076200                                                                  07220000
076300     IF HLD-REV2  = '0652'                                        07230000
076400        COMPUTE WRK-PAY-RATE2 ROUNDED =                           07240000
076500         (((442.80 * HLD-BENE-WAGE-IND)                           07250000
076600                                   + 201.65) / 24) * HLD-UNITS2.  07260000
076700                                                                  07270000
076800     IF HLD-REV3  = '0655'                                        07280000
076900        COMPUTE WRK-PAY-RATE3 ROUNDED =                           07290000
077000         ((61.83 * HLD-PROV-WAGE-IND) + 52.39) * HLD-UNITS3.      07300000
077100                                                                  07310000
077200     IF HLD-REV4  = '0656'                                        07320000
077300        COMPUTE WRK-PAY-RATE4 ROUNDED =                           07330000
077400         ((314.41 * HLD-PROV-WAGE-IND) + 176.78) * HLD-UNITS4.    07340000
077500                                                                  07350000
077600     COMPUTE HLD-PAY-AMT =                                        07360000
077700             WRK-PAY-RATE1 +                                      07370000
077800             WRK-PAY-RATE2 +                                      07380000
077900             WRK-PAY-RATE3 +                                      07390000
078000             WRK-PAY-RATE4.                                       07400000
078100                                                                  07410000
078200     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   07420000
078300     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   07430000
078400     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   07440000
078500     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   07450000
078600                                                                  07460000
078700                                                                  07470000
078800     MOVE ZEROES TO WRK-PAY-RATE1                                 07480000
078900                     WRK-PAY-RATE2                                07490000
079000                     WRK-PAY-RATE3                                07500000
079100                     WRK-PAY-RATE4.                               07510000
079200                                                                  07520000
079300 2002-EXIT.  EXIT.                                                07530000
079400                                                                  07540000
079500*----------------------------------------------------------****   07550000
079600*  FY 2003 PROCESS                                                07560000
079700*----------------------------------------------------------****   07570000
079800                                                                  07580000
079900 2003-PROCESS-DATA.                                               07590000
080000     IF HLD-UNITS1 > 1000 OR                                      07600000
080100        HLD-UNITS2 > 1000 OR                                      07610000
080200        HLD-UNITS3 > 1000 OR                                      07620000
080300        HLD-UNITS4 > 1000                                         07630000
080400        MOVE '10' TO HLD-RTC                                      07640000
080500        GO TO 2003-EXIT.                                          07650000
080600                                                                  07660000
080700     IF HLD-REV2  = '0652'                                        07670000
080800        IF HLD-UNITS2 < 8                                         07680000
080900           MOVE '20' TO HLD-RTC                                   07690000
081000           GO TO 2003-EXIT.                                       07700000
081100                                                                  07710000
081200****    CALCULATE HOME RATE BY REVENUE CODE                       07720000
081300****    CALCULATE HOME RATE BY REVENUE CODE                       07730000
081400                                                                  07740000
081500     IF HLD-REV1  = '0651'                                        07750000
081600        COMPUTE WRK-PAY-RATE1 ROUNDED =                           07760000
081700         ((78.47 * HLD-BENE-WAGE-IND) + 35.73) * HLD-UNITS1.      07770000
081800                                                                  07780000
081900     IF HLD-REV2  = '0652'                                        07790000
082000        COMPUTE WRK-PAY-RATE2 ROUNDED =                           07800000
082100         (((457.97 * HLD-BENE-WAGE-IND)                           07810000
082200                                   + 208.55) / 24) * HLD-UNITS2.  07820000
082300                                                                  07830000
082400     IF HLD-REV3  = '0655'                                        07840000
082500        COMPUTE WRK-PAY-RATE3 ROUNDED =                           07850000
082600         ((63.94 * HLD-PROV-WAGE-IND) + 54.19) * HLD-UNITS3.      07860000
082700                                                                  07870000
082800     IF HLD-REV4  = '0656'                                        07880000
082900        COMPUTE WRK-PAY-RATE4 ROUNDED =                           07890000
083000         ((325.18 * HLD-PROV-WAGE-IND) + 182.83) * HLD-UNITS4.    07900000
083100                                                                  07910000
083200     COMPUTE HLD-PAY-AMT =                                        07920000
083300             WRK-PAY-RATE1 +                                      07930000
083400             WRK-PAY-RATE2 +                                      07940000
083500             WRK-PAY-RATE3 +                                      07950000
083600             WRK-PAY-RATE4.                                       07960000
083700                                                                  07970000
083800     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   07980000
083900     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   07990000
084000     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   08000000
084100     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   08010000
084200                                                                  08020000
084300                                                                  08030000
084400     MOVE ZEROES TO WRK-PAY-RATE1                                 08040000
084500                     WRK-PAY-RATE2                                08050000
084600                     WRK-PAY-RATE3                                08060000
084700                     WRK-PAY-RATE4.                               08070000
084800                                                                  08080000
084900 2003-EXIT.  EXIT.                                                08090000
085000                                                                  08100000
085100*----------------------------------------------------------****   08110000
085200*  FY 2004 PROCESS                                                08120000
085300*----------------------------------------------------------****   08130000
085400                                                                  08140000
085500 2004-PROCESS-DATA.                                               08150000
085600     IF HLD-UNITS1 > 1000 OR                                      08160000
085700        HLD-UNITS2 > 1000 OR                                      08170000
085800        HLD-UNITS3 > 1000 OR                                      08180000
085900        HLD-UNITS4 > 1000                                         08190000
086000        MOVE '10' TO HLD-RTC                                      08200000
086100        GO TO 2004-EXIT.                                          08210000
086200                                                                  08220000
086300     IF HLD-REV2  = '0652'                                        08230000
086400        IF HLD-UNITS2 < 8                                         08240000
086500           MOVE '20' TO HLD-RTC                                   08250000
086600           GO TO 2004-EXIT.                                       08260000
086700                                                                  08270000
086800****    CALCULATE HOME RATE BY REVENUE CODE                       08280000
086900****    CALCULATE HOME RATE BY REVENUE CODE                       08290000
087000                                                                  08300000
087100     IF HLD-REV1  = '0651'                                        08310000
087200        COMPUTE WRK-PAY-RATE1 ROUNDED =                           08320000
087300         ((81.13 * HLD-BENE-WAGE-IND) + 36.95) * HLD-UNITS1.      08330000
087400                                                                  08340000
087500     IF HLD-REV2  = '0652'                                        08350000
087600        COMPUTE WRK-PAY-RATE2 ROUNDED =                           08360000
087700         (((473.54 * HLD-BENE-WAGE-IND)                           08370000
087800                                   + 215.64) / 24) * HLD-UNITS2.  08380000
087900                                                                  08390000
088000     IF HLD-REV3  = '0655'                                        08400000
088100        COMPUTE WRK-PAY-RATE3 ROUNDED =                           08410000
088200         ((66.12 * HLD-PROV-WAGE-IND) + 56.03) * HLD-UNITS3.      08420000
088300                                                                  08430000
088400     IF HLD-REV4  = '0656'                                        08440000
088500        COMPUTE WRK-PAY-RATE4 ROUNDED =                           08450000
088600         ((336.23 * HLD-PROV-WAGE-IND) + 189.05) * HLD-UNITS4.    08460000
088700                                                                  08470000
088800     COMPUTE HLD-PAY-AMT =                                        08480000
088900             WRK-PAY-RATE1 +                                      08490000
089000             WRK-PAY-RATE2 +                                      08500000
089100             WRK-PAY-RATE3 +                                      08510000
089200             WRK-PAY-RATE4.                                       08520000
089300                                                                  08530000
089400     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   08540000
089500     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   08550000
089600     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   08560000
089700     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   08570000
089800                                                                  08580000
089900                                                                  08590000
090000     MOVE ZEROES TO WRK-PAY-RATE1                                 08600000
090100                     WRK-PAY-RATE2                                08610000
090200                     WRK-PAY-RATE3                                08620000
090300                     WRK-PAY-RATE4.                               08630000
090400                                                                  08640000
090500 2004-EXIT.  EXIT.                                                08650000
090600                                                                  08660000
090700*----------------------------------------------------------****   08670000
090800*  FY 2005 PROCESS                                                08680000
090900*----------------------------------------------------------****   08690000
091000                                                                  08700000
091100 2005-PROCESS-DATA.                                               08710000
091200     IF HLD-UNITS1 > 1000 OR                                      08720000
091300        HLD-UNITS2 > 1000 OR                                      08730000
091400        HLD-UNITS3 > 1000 OR                                      08740000
091500        HLD-UNITS4 > 1000                                         08750000
091600        MOVE '10' TO HLD-RTC                                      08760000
091700        GO TO 2005-EXIT.                                          08770000
091800                                                                  08780000
091900     IF HLD-REV2  = '0652'                                        08790000
092000        IF HLD-UNITS2 < 8                                         08800000
092100           MOVE '20' TO HLD-RTC                                   08810000
092200           GO TO 2005-EXIT.                                       08820000
092300                                                                  08830000
092400****    CALCULATE HOME RATE BY REVENUE CODE                       08840000
092500****    CALCULATE HOME RATE BY REVENUE CODE                       08850000
092600                                                                  08860000
092700     IF HLD-REV1  = '0651'                                        08870000
092800        COMPUTE WRK-PAY-RATE1 ROUNDED =                           08880000
092900         ((83.81 * HLD-BENE-WAGE-IND) + 38.17) * HLD-UNITS1.      08890000
093000                                                                  08900000
093100     IF HLD-REV2  = '0652'                                        08910000
093200        COMPUTE WRK-PAY-RATE2 ROUNDED =                           08920000
093300         (((489.16 * HLD-BENE-WAGE-IND)                           08930000
093400                                   + 222.76) / 24) * HLD-UNITS2.  08940000
093500                                                                  08950000
093600     IF HLD-REV3  = '0655'                                        08960000
093700        COMPUTE WRK-PAY-RATE3 ROUNDED =                           08970000
093800         ((68.30 * HLD-PROV-WAGE-IND) + 57.88) * HLD-UNITS3.      08980000
093900                                                                  08990000
094000     IF HLD-REV4  = '0656'                                        09000000
094100        COMPUTE WRK-PAY-RATE4 ROUNDED =                           09010000
094200         ((347.32 * HLD-PROV-WAGE-IND) + 195.29) * HLD-UNITS4.    09020000
094300                                                                  09030000
094400     COMPUTE HLD-PAY-AMT =                                        09040000
094500             WRK-PAY-RATE1 +                                      09050000
094600             WRK-PAY-RATE2 +                                      09060000
094700             WRK-PAY-RATE3 +                                      09070000
094800             WRK-PAY-RATE4.                                       09080000
094900                                                                  09090000
095000     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   09100000
095100     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   09110000
095200     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   09120000
095300     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   09130000
095400                                                                  09140000
095500                                                                  09150000
095600     MOVE ZEROES TO WRK-PAY-RATE1                                 09160000
095700                     WRK-PAY-RATE2                                09170000
095800                     WRK-PAY-RATE3                                09180000
095900                     WRK-PAY-RATE4.                               09190000
096000                                                                  09200000
096100 2005-EXIT.  EXIT.                                                09210000
096200                                                                  09220000
096300*----------------------------------------------------------****   09230000
096400*  FY 2006 PROCESS                                                09240000
096500*----------------------------------------------------------****   09250000
096600                                                                  09260000
096700 2006-PROCESS-DATA.                                               09270000
096800     IF HLD-UNITS1 > 1000 OR                                      09280000
096900        HLD-UNITS2 > 1000 OR                                      09290000
097000        HLD-UNITS3 > 1000 OR                                      09300000
097100        HLD-UNITS4 > 1000                                         09310000
097200        MOVE '10' TO HLD-RTC                                      09320000
097300        GO TO 2006-EXIT.                                          09330000
097400                                                                  09340000
097500     IF HLD-REV2  = '0652'                                        09350000
097600        IF HLD-UNITS2 < 8                                         09360000
097700           MOVE '20' TO HLD-RTC                                   09370000
097800           GO TO 2006-EXIT.                                       09380000
097900                                                                  09390000
098000****    CALCULATE HOME RATE BY REVENUE CODE                       09400000
098100****    CALCULATE HOME RATE BY REVENUE CODE                       09410000
098200                                                                  09420000
098300     IF HLD-REV1  = '0651'                                        09430000
098400        COMPUTE WRK-PAY-RATE1 ROUNDED =                           09440000
098500         ((86.91 * HLD-BENE-WAGE-IND) + 39.58) * HLD-UNITS1.      09450000
098600                                                                  09460000
098700     IF HLD-REV2  = '0652'                                        09470000
098800        COMPUTE WRK-PAY-RATE2 ROUNDED =                           09480000
098900         (((507.26 * HLD-BENE-WAGE-IND)                           09490000
099000                                   + 231.00) / 24) * HLD-UNITS2.  09500000
099100                                                                  09510000
099200     IF HLD-REV3  = '0655'                                        09520000
099300        COMPUTE WRK-PAY-RATE3 ROUNDED =                           09530000
099400         ((70.83 * HLD-PROV-WAGE-IND) + 60.02) * HLD-UNITS3.      09540000
099500                                                                  09550000
099600     IF HLD-REV4  = '0656'                                        09560000
099700        COMPUTE WRK-PAY-RATE4 ROUNDED =                           09570000
099800         ((360.18 * HLD-PROV-WAGE-IND) + 202.51) * HLD-UNITS4.    09580000
099900                                                                  09590000
100000     COMPUTE HLD-PAY-AMT =                                        09600000
100100             WRK-PAY-RATE1 +                                      09610000
100200             WRK-PAY-RATE2 +                                      09620000
100300             WRK-PAY-RATE3 +                                      09630000
100400             WRK-PAY-RATE4.                                       09640000
100500                                                                  09650000
100600     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   09660000
100700     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   09670000
100800     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   09680000
100900     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   09690000
101000                                                                  09700000
101100                                                                  09710000
101200     MOVE ZEROES TO WRK-PAY-RATE1                                 09720000
101300                     WRK-PAY-RATE2                                09730000
101400                     WRK-PAY-RATE3                                09740000
101500                     WRK-PAY-RATE4.                               09750000
101600                                                                  09760000
101700 2006-EXIT.  EXIT.                                                09770000
101800                                                                  09780000
101900*----------------------------------------------------------****   09790000
102000*  FY 2007 PROCESS                                                09800000
102100*----------------------------------------------------------****   09810000
102200                                                                  09820000
102300 2007-PROCESS-DATA.                                               09830000
102400     IF HLD-UNITS1 > 1000 OR                                      09840000
102500        HLD-UNITS2 > 1000 OR                                      09850000
102600        HLD-UNITS3 > 1000 OR                                      09860000
102700        HLD-UNITS4 > 1000                                         09870000
102800        MOVE '10' TO HLD-RTC                                      09880000
102900        GO TO 2007-EXIT.                                          09890000
103000                                                                  09900000
103100     IF HLD-REV2  = '0652'                                        09910000
103200        IF HLD-UNITS2 < 8                                         09920000
103300           MOVE '20' TO HLD-RTC                                   09930000
103400           GO TO 2007-EXIT.                                       09940000
103500                                                                  09950000
103600****    CALCULATE HOME RATE BY REVENUE CODE                       09960000
103700****    CALCULATE HOME RATE BY REVENUE CODE                       09970000
103800                                                                  09980000
103900     IF HLD-REV1  = '0651'                                        09990000
104000        COMPUTE WRK-PAY-RATE1 ROUNDED =                           10000000
104100         ((89.87 * HLD-BENE-WAGE-IND) + 40.92) * HLD-UNITS1.      10010000
104200                                                                  10020000
104300     IF HLD-REV2  = '0652'                                        10030000
104400        COMPUTE WRK-PAY-RATE2 ROUNDED =                           10040000
104500         (((524.50 * HLD-BENE-WAGE-IND)                           10050000
104600                                   + 238.86) / 24) * HLD-UNITS2.  10060000
104700                                                                  10070000
104800     IF HLD-REV3  = '0655'                                        10080000
104900        COMPUTE WRK-PAY-RATE3 ROUNDED =                           10090000
105000         ((73.24 * HLD-PROV-WAGE-IND) + 62.06) * HLD-UNITS3.      10100000
105100                                                                  10110000
105200     IF HLD-REV4  = '0656'                                        10120000
105300        COMPUTE WRK-PAY-RATE4 ROUNDED =                           10130000
105400         ((372.42 * HLD-PROV-WAGE-IND) + 209.40) * HLD-UNITS4.    10140000
105500                                                                  10150000
105600     COMPUTE HLD-PAY-AMT =                                        10160000
105700             WRK-PAY-RATE1 +                                      10170000
105800             WRK-PAY-RATE2 +                                      10180000
105900             WRK-PAY-RATE3 +                                      10190000
106000             WRK-PAY-RATE4.                                       10200000
106100                                                                  10210000
106200     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   10220000
106300     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   10230000
106400     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   10240000
106500     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   10250000
106600                                                                  10260000
106700                                                                  10270000
106800     MOVE ZEROES TO WRK-PAY-RATE1                                 10280000
106900                     WRK-PAY-RATE2                                10290000
107000                     WRK-PAY-RATE3                                10300000
107100                     WRK-PAY-RATE4.                               10310000
107200                                                                  10320000
107300 2007-EXIT.  EXIT.                                                10330000
107400                                                                  10340000
107500*----------------------------------------------------------****   10350000
107600*  FY 2007-1 PROCESS                                              10360000
107700*----------------------------------------------------------****   10370000
107800                                                                  10380000
107900 2007-1-PROCESS-DATA.                                             10390000
108000     IF HLD-UNITS1 > 1000 OR                                      10400000
108100        HLD-UNITS2 > 1000 OR                                      10410000
108200        HLD-UNITS3 > 1000 OR                                      10420000
108300        HLD-UNITS4 > 1000                                         10430000
108400        MOVE '10' TO HLD-RTC                                      10440000
108500        GO TO 2007-1-EXIT.                                        10450003
108600                                                                  10460000
108700****    CALCULATE HOME RATE BY REVENUE CODE                       10470000
108800****    CALCULATE HOME RATE BY REVENUE CODE                       10480000
108900                                                                  10490000
109000     IF HLD-REV1  = '0651'                                        10500000
109100        COMPUTE WRK-PAY-RATE1 ROUNDED =                           10510000
109200            ((89.87 * HLD-BENE-WAGE-IND) + 40.92) * HLD-UNITS1.   10520000
109300                                                                  10530000
109400     IF HLD-REV2  = '0652'                                        10540000
109500        IF HLD-UNITS2 > 0                                         10550000
109600           IF HLD-UNITS2 < 32                                     10560000
109700             COMPUTE WRK-PAY-RATE2 ROUNDED =                      10570000
109800               ((89.87 * HLD-BENE-WAGE-IND) + 40.92)              10580000
109900           ELSE                                                   10590000
110000             COMPUTE WRK-PAY-RATE2 ROUNDED =                      10600000
110100               (((524.50 * HLD-BENE-WAGE-IND)                     10610000
110200                      + 238.86) / 24) * (HLD-UNITS2 / 4).         10620000
110300                                                                  10630000
110400     IF HLD-REV3  = '0655'                                        10640000
110500        COMPUTE WRK-PAY-RATE3 ROUNDED =                           10650000
110600            ((73.24 * HLD-PROV-WAGE-IND) + 62.06) * HLD-UNITS3.   10660000
110700                                                                  10670000
110800     IF HLD-REV4  = '0656'                                        10680000
110900        COMPUTE WRK-PAY-RATE4 ROUNDED =                           10690000
111000            ((372.42 * HLD-PROV-WAGE-IND) + 209.40) * HLD-UNITS4. 10700000
111100                                                                  10710000
111200     COMPUTE HLD-PAY-AMT =                                        10720000
111300             WRK-PAY-RATE1 +                                      10730000
111400             WRK-PAY-RATE2 +                                      10740000
111500             WRK-PAY-RATE3 +                                      10750000
111600             WRK-PAY-RATE4.                                       10760000
111700                                                                  10770000
111800     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   10780000
111900     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   10790000
112000     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   10800000
112100     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   10810000
112200                                                                  10820000
112300                                                                  10830000
112400     MOVE ZEROES TO WRK-PAY-RATE1                                 10840000
112500                     WRK-PAY-RATE2                                10850000
112600                     WRK-PAY-RATE3                                10860000
112700                     WRK-PAY-RATE4.                               10870000
112800                                                                  10880000
112900 2007-1-EXIT. EXIT.                                               10890000
113000*----------------------------------------------------------****   10900000
113100*----------------------------------------------------------****   10910000
113200*  FY 2008 PROCESS                                                10920000
113300*----------------------------------------------------------****   10930000
113400                                                                  10940000
113500 2008-PROCESS-DATA.                                               10950000
113600     IF HLD-UNITS1 > 1000 OR                                      10960000
113700        HLD-UNITS2 > 1000 OR                                      10970000
113800        HLD-UNITS3 > 1000 OR                                      10980000
113900        HLD-UNITS4 > 1000                                         10990000
114000        MOVE '10' TO HLD-RTC                                      11000000
114100        GO TO 2008-EXIT.                                          11010003
114200                                                                  11020000
114300****    CALCULATE HOME RATE BY REVENUE CODE                       11030000
114400****    CALCULATE HOME RATE BY REVENUE CODE                       11040000
114500                                                                  11050000
114600     IF HLD-REV1  = '0651'                                        11060000
114700        COMPUTE WRK-PAY-RATE1 ROUNDED =                           11070000
114800            ((92.83 * HLD-BENE-WAGE-IND) + 42.28) * HLD-UNITS1.   11080000
114900                                                                  11090000
115000     IF HLD-REV2  = '0652'                                        11100000
115100        IF HLD-UNITS2 > 0                                         11110000
115200           IF HLD-UNITS2 < 32                                     11120000
115300             COMPUTE WRK-PAY-RATE2 ROUNDED =                      11130000
115400               ((92.83 * HLD-BENE-WAGE-IND) + 42.28)              11140000
115500           ELSE                                                   11150000
115600             COMPUTE WRK-PAY-RATE2 ROUNDED =                      11160000
115700               (((541.81 * HLD-BENE-WAGE-IND)                     11170000
115800                      + 246.74) / 24) * (HLD-UNITS2 / 4).         11180000
115900                                                                  11190000
116000     IF HLD-REV3  = '0655'                                        11200000
116100        COMPUTE WRK-PAY-RATE3 ROUNDED =                           11210000
116200            ((75.65 * HLD-PROV-WAGE-IND) + 64.11) * HLD-UNITS3.   11220000
116300                                                                  11230000
116400     IF HLD-REV4  = '0656'                                        11240000
116500        COMPUTE WRK-PAY-RATE4 ROUNDED =                           11250000
116600            ((384.71 * HLD-PROV-WAGE-IND) + 216.31) * HLD-UNITS4. 11260000
116700                                                                  11270000
116800     COMPUTE HLD-PAY-AMT =                                        11280000
116900             WRK-PAY-RATE1 +                                      11290000
117000             WRK-PAY-RATE2 +                                      11300000
117100             WRK-PAY-RATE3 +                                      11310000
117200             WRK-PAY-RATE4.                                       11320000
117300                                                                  11330000
117400     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   11340000
117500     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   11350000
117600     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   11360000
117700     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   11370000
117800                                                                  11380000
117900                                                                  11390000
118000     MOVE ZEROES TO WRK-PAY-RATE1                                 11400000
118100                     WRK-PAY-RATE2                                11410000
118200                     WRK-PAY-RATE3                                11420000
118300                     WRK-PAY-RATE4.                               11430000
118400                                                                  11440000
118500 2008-EXIT. EXIT.                                                 11450000
118600*----------------------------------------------------------****   11460000
118700*----------------------------------------------------------****   11470001
118800*  FY 2009 PROCESS                                                11480001
118900*----------------------------------------------------------****   11490001
119000                                                                  11500001
119100 2009-PROCESS-DATA.                                               11510001
119200     IF HLD-UNITS1 > 1000 OR                                      11520001
119300        HLD-UNITS2 > 1000 OR                                      11530001
119400        HLD-UNITS3 > 1000 OR                                      11540001
119500        HLD-UNITS4 > 1000                                         11550001
119600        MOVE '10' TO HLD-RTC                                      11560001
119700        GO TO 2009-EXIT.                                          11570003
119800                                                                  11580001
119900****    CALCULATE HOME RATE BY REVENUE CODE                       11590001
120000****    CALCULATE HOME RATE BY REVENUE CODE                       11600001
120100                                                                  11610001
120200     IF HLD-REV1  = '0651'                                        11620001
120300        COMPUTE WRK-PAY-RATE1 ROUNDED =                           11630001
120400            ((96.17 * HLD-BENE-WAGE-IND) + 43.80) * HLD-UNITS1.   11640003
120500                                                                  11650001
120600     IF HLD-REV2  = '0652'                                        11660001
120700        IF HLD-UNITS2 > 0                                         11670001
120800           IF HLD-UNITS2 < 32                                     11680001
120900             COMPUTE WRK-PAY-RATE2 ROUNDED =                      11690001
121000               ((96.17 * HLD-BENE-WAGE-IND) + 43.80)              11700003
121100           ELSE                                                   11710001
121200             COMPUTE WRK-PAY-RATE2 ROUNDED =                      11720001
121300               (((561.32 * HLD-BENE-WAGE-IND)                     11730003
121400                      + 255.62) / 24) * (HLD-UNITS2 / 4).         11740003
121500                                                                  11750001
121600     IF HLD-REV3  = '0655'                                        11760001
121700        COMPUTE WRK-PAY-RATE3 ROUNDED =                           11770001
121800            ((78.37 * HLD-PROV-WAGE-IND) + 66.42) * HLD-UNITS3.   11780003
121900                                                                  11790001
122000     IF HLD-REV4  = '0656'                                        11800001
122100        COMPUTE WRK-PAY-RATE4 ROUNDED =                           11810001
122200            ((398.56 * HLD-PROV-WAGE-IND) + 224.10) * HLD-UNITS4. 11820003
122300                                                                  11830001
122400     COMPUTE HLD-PAY-AMT =                                        11840001
122500             WRK-PAY-RATE1 +                                      11850001
122600             WRK-PAY-RATE2 +                                      11860001
122700             WRK-PAY-RATE3 +                                      11870001
122800             WRK-PAY-RATE4.                                       11880001
122900                                                                  11890001
123000     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   11900001
123100     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   11910001
123200     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   11920001
123300     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   11930001
123400                                                                  11940001
123500                                                                  11950001
123600     MOVE ZEROES TO WRK-PAY-RATE1                                 11960001
123700                     WRK-PAY-RATE2                                11970001
123800                     WRK-PAY-RATE3                                11980001
123900                     WRK-PAY-RATE4.                               11990001
124000                                                                  12000001
124100 2009-EXIT. EXIT.                                                 12010001
124200*----------------------------------------------------------****   12020003
124300*----------------------------------------------------------****   12030001
124400*  FY 2010 PROCESS                                                12040001
124500*----------------------------------------------------------****   12050001
124600                                                                  12060001
124700 2010-PROCESS-DATA.                                               12070001
124800     IF HLD-UNITS1 > 1000 OR                                      12080001
124900        HLD-UNITS2 > 1000 OR                                      12090001
125000        HLD-UNITS3 > 1000 OR                                      12100001
125100        HLD-UNITS4 > 1000                                         12110001
125200        MOVE '10' TO HLD-RTC                                      12120001
125300        GO TO 2010-EXIT.                                          12130003
125400                                                                  12140001
125500****    CALCULATE HOME RATE BY REVENUE CODE                       12150001
125600****    CALCULATE HOME RATE BY REVENUE CODE                       12160001
125700                                                                  12170001
125800     IF HLD-REV1  = '0651'                                        12180001
125900        COMPUTE WRK-PAY-RATE1 ROUNDED =                           12190001
126000            ((98.19 * HLD-BENE-WAGE-IND) + 44.72) * HLD-UNITS1.   12200003
126100                                                                  12210001
126200     IF HLD-REV2  = '0652'                                        12220001
126300        IF HLD-UNITS2 > 0                                         12230001
126400           IF HLD-UNITS2 < 32                                     12240001
126500             COMPUTE WRK-PAY-RATE2 ROUNDED =                      12250001
126600               ((98.19 * HLD-BENE-WAGE-IND) + 44.72)              12260003
126700           ELSE                                                   12270001
126800             COMPUTE WRK-PAY-RATE2 ROUNDED =                      12280001
126900               (((573.11 * HLD-BENE-WAGE-IND)                     12290003
127000                      + 260.99) / 24) * (HLD-UNITS2 / 4).         12300003
127100                                                                  12310001
127200     IF HLD-REV3  = '0655'                                        12320001
127300        COMPUTE WRK-PAY-RATE3 ROUNDED =                           12330001
127400            ((80.02 * HLD-PROV-WAGE-IND) + 67.81) * HLD-UNITS3.   12340003
127500                                                                  12350001
127600     IF HLD-REV4  = '0656'                                        12360001
127700        COMPUTE WRK-PAY-RATE4 ROUNDED =                           12370001
127800            ((406.94 * HLD-PROV-WAGE-IND) + 228.80) * HLD-UNITS4. 12380003
127900                                                                  12390001
128000     COMPUTE HLD-PAY-AMT =                                        12400001
128100             WRK-PAY-RATE1 +                                      12410001
128200             WRK-PAY-RATE2 +                                      12420001
128300             WRK-PAY-RATE3 +                                      12430001
128400             WRK-PAY-RATE4.                                       12440001
128500                                                                  12450001
128600     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   12460001
128700     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   12470001
128800     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   12480001
128900     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   12490001
129000                                                                  12500001
129100                                                                  12510001
129200     MOVE ZEROES TO WRK-PAY-RATE1                                 12520001
129300                     WRK-PAY-RATE2                                12530001
129400                     WRK-PAY-RATE3                                12540001
129500                     WRK-PAY-RATE4.                               12550001
129600                                                                  12560001
129700 2010-EXIT. EXIT.                                                 12570001
129800*----------------------------------------------------------****   12580001
129900*  FY 2011 PROCESS                                                12590001
130000*----------------------------------------------------------****   12600001
130100                                                                  12610001
130200 2011-PROCESS-DATA.                                               12620001
130300     IF HLD-UNITS1 > 1000 OR                                      12630001
130400        HLD-UNITS2 > 1000 OR                                      12640001
130500        HLD-UNITS3 > 1000 OR                                      12650001
130600        HLD-UNITS4 > 1000                                         12660001
130700        MOVE '10' TO HLD-RTC                                      12670001
130800        GO TO 2011-EXIT.                                          12680003
130900                                                                  12690001
131000****    CALCULATE HOME RATE BY REVENUE CODE                       12700001
131100****    CALCULATE HOME RATE BY REVENUE CODE                       12710001
131200                                                                  12720001
131300     IF HLD-REV1  = '0651'                                        12730001
131400        COMPUTE WRK-PAY-RATE1 ROUNDED =                           12740001
131500            ((100.75 * HLD-BENE-WAGE-IND) + 45.88) * HLD-UNITS1.  12750003
131600                                                                  12760001
131700     IF HLD-REV2  = '0652'                                        12770001
131800        IF HLD-UNITS2 > 0                                         12780001
131900           IF HLD-UNITS2 < 32                                     12790001
132000             COMPUTE WRK-PAY-RATE2 ROUNDED =                      12800001
132100               ((100.75 * HLD-BENE-WAGE-IND) + 45.88)             12810003
132200           ELSE                                                   12820001
132300             COMPUTE WRK-PAY-RATE2 ROUNDED =                      12830001
132400               (((588.01 * HLD-BENE-WAGE-IND)                     12840003
132500                      + 267.78) / 24) * (HLD-UNITS2 / 4).         12850003
132600                                                                  12860001
132700     IF HLD-REV3  = '0655'                                        12870001
132800        COMPUTE WRK-PAY-RATE3 ROUNDED =                           12880001
132900            ((82.10 * HLD-PROV-WAGE-IND) + 69.57) * HLD-UNITS3.   12890003
133000                                                                  12900001
133100     IF HLD-REV4  = '0656'                                        12910001
133200        COMPUTE WRK-PAY-RATE4 ROUNDED =                           12920001
133300            ((417.52 * HLD-PROV-WAGE-IND) + 234.75) * HLD-UNITS4. 12930003
133400                                                                  12940001
133500     COMPUTE HLD-PAY-AMT =                                        12950001
133600             WRK-PAY-RATE1 +                                      12960001
133700             WRK-PAY-RATE2 +                                      12970001
133800             WRK-PAY-RATE3 +                                      12980001
133900             WRK-PAY-RATE4.                                       12990001
134000                                                                  13000001
134100     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   13010001
134200     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   13020001
134300     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   13030001
134400     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   13040001
134500                                                                  13050001
134600                                                                  13060001
134700     MOVE ZEROES TO WRK-PAY-RATE1                                 13070001
134800                     WRK-PAY-RATE2                                13080001
134900                     WRK-PAY-RATE3                                13090001
135000                     WRK-PAY-RATE4.                               13100001
135100                                                                  13110001
135200 2011-EXIT. EXIT.                                                 13120001
135300                                                                  13130001
135400*----------------------------------------------------------****   13140001
135500*  FY 2012 PROCESS                                                13150001
135600*----------------------------------------------------------****   13160001
135700                                                                  13170001
135800 2012-PROCESS-DATA.                                               13180001
135900     IF HLD-UNITS1 > 1000 OR                                      13190001
136000        HLD-UNITS2 > 1000 OR                                      13200001
136100        HLD-UNITS3 > 1000 OR                                      13210001
136200        HLD-UNITS4 > 1000                                         13220001
136300        MOVE '10' TO HLD-RTC                                      13230001
136400        GO TO 2012-EXIT.                                          13240003
136500                                                                  13250001
136600****    CALCULATE HOME RATE BY REVENUE CODE                       13260001
136700****    CALCULATE HOME RATE BY REVENUE CODE                       13270001
136800                                                                  13280001
136900     IF HLD-REV1  = '0651'                                        13290001
137000        COMPUTE WRK-PAY-RATE1 ROUNDED =                           13300001
137100            ((103.77 * HLD-BENE-WAGE-IND) + 47.26) * HLD-UNITS1.  13310003
137200                                                                  13320001
137300     IF HLD-REV2  = '0652'                                        13330001
137400        IF HLD-UNITS2 > 0                                         13340001
137500           IF HLD-UNITS2 < 32                                     13350001
137600             COMPUTE WRK-PAY-RATE2 ROUNDED =                      13360001
137700               ((103.77 * HLD-BENE-WAGE-IND) + 47.26)             13370003
137800           ELSE                                                   13380001
137900             COMPUTE WRK-PAY-RATE2 ROUNDED =                      13390001
138000               (((605.65 * HLD-BENE-WAGE-IND)                     13400003
138100                      + 275.81) / 24) * (HLD-UNITS2 / 4).         13410003
138200                                                                  13420001
138300     IF HLD-REV3  = '0655'                                        13430001
138400        COMPUTE WRK-PAY-RATE3 ROUNDED =                           13440001
138500            ((84.56 * HLD-PROV-WAGE-IND) + 71.66) * HLD-UNITS3.   13450003
138600                                                                  13460001
138700     IF HLD-REV4  = '0656'                                        13470001
138800        COMPUTE WRK-PAY-RATE4 ROUNDED =                           13480001
138900            ((430.04 * HLD-PROV-WAGE-IND) + 241.80) * HLD-UNITS4. 13490003
139000                                                                  13500001
139100     COMPUTE HLD-PAY-AMT =                                        13510001
139200             WRK-PAY-RATE1 +                                      13520001
139300             WRK-PAY-RATE2 +                                      13530001
139400             WRK-PAY-RATE3 +                                      13540001
139500             WRK-PAY-RATE4.                                       13550001
139600                                                                  13560001
139700     MOVE WRK-PAY-RATE1        TO HLD-THEIR-PAY-CHG1.             13570001
139800     MOVE WRK-PAY-RATE2        TO HLD-THEIR-PAY-CHG2.             13580001
139900     MOVE WRK-PAY-RATE3        TO HLD-THEIR-PAY-CHG3.             13590001
140000     MOVE WRK-PAY-RATE4        TO HLD-THEIR-PAY-CHG4.             13600001
140100                                                                  13610001
140200                                                                  13620001
140300     MOVE ZEROES               TO WRK-PAY-RATE1                   13630001
140400                                  WRK-PAY-RATE2                   13640001
140500                                  WRK-PAY-RATE3                   13650001
140600                                  WRK-PAY-RATE4.                  13660001
140700                                                                  13670001
140800 2012-EXIT. EXIT.                                                 13680001
140900                                                                  13690001
141000*----------------------------------------------------------****   13700001
141100*  FY 2013 PROCESS                                                13710001
141200*----------------------------------------------------------****   13720001
141300                                                                  13730001
141400 2013-PROCESS-DATA.                                               13740001
141500     IF HLD-UNITS1 > 1000 OR                                      13750001
141600        HLD-UNITS2 > 1000 OR                                      13760001
141700        HLD-UNITS3 > 1000 OR                                      13770001
141800        HLD-UNITS4 > 1000                                         13780001
141900        MOVE '10' TO HLD-RTC                                      13790001
142000        GO TO 2013-EXIT.                                          13800003
142100                                                                  13810001
142200****    CALCULATE HOME RATE BY REVENUE CODE                       13820001
142300****    CALCULATE HOME RATE BY REVENUE CODE                       13830001
142400                                                                  13840001
142500     IF HLD-REV1  = '0651'                                        13850001
142600        COMPUTE WRK-PAY-RATE1 ROUNDED =                           13860001
142700            ((105.44 * HLD-BENE-WAGE-IND) + 48.01) * HLD-UNITS1.  13870003
142800                                                                  13880001
142900     IF HLD-REV2  = '0652'                                        13890001
143000        IF HLD-UNITS2 > 0                                         13900001
143100           IF HLD-UNITS2 < 32                                     13910001
143200             COMPUTE WRK-PAY-RATE2 ROUNDED =                      13920001
143300               ((105.44 * HLD-BENE-WAGE-IND) + 48.01)             13930003
143400           ELSE                                                   13940001
143500             COMPUTE WRK-PAY-RATE2 ROUNDED =                      13950001
143600               (((615.34 * HLD-BENE-WAGE-IND)                     13960003
143700                      + 280.22) / 24) * (HLD-UNITS2 / 4).         13970003
143800                                                                  13980001
143900     IF HLD-REV3  = '0655'                                        13990001
144000        COMPUTE WRK-PAY-RATE3 ROUNDED =                           14000001
144100            ((85.92 * HLD-PROV-WAGE-IND) + 72.80) * HLD-UNITS3.   14010003
144200                                                                  14020001
144300     IF HLD-REV4  = '0656'                                        14030001
144400        COMPUTE WRK-PAY-RATE4 ROUNDED =                           14040001
144500            ((436.93 * HLD-PROV-WAGE-IND) + 245.66) * HLD-UNITS4. 14050003
144600                                                                  14060001
144700     COMPUTE HLD-PAY-AMT =                                        14070001
144800             WRK-PAY-RATE1 +                                      14080001
144900             WRK-PAY-RATE2 +                                      14090001
145000             WRK-PAY-RATE3 +                                      14100001
145100             WRK-PAY-RATE4.                                       14110001
145200                                                                  14120001
145300     MOVE WRK-PAY-RATE1        TO  HLD-THEIR-PAY-CHG1.            14130001
145400     MOVE WRK-PAY-RATE2        TO  HLD-THEIR-PAY-CHG2.            14140001
145500     MOVE WRK-PAY-RATE3        TO  HLD-THEIR-PAY-CHG3.            14150001
145600     MOVE WRK-PAY-RATE4        TO HLD-THEIR-PAY-CHG4.             14160001
145700                                                                  14170001
145800                                                                  14180001
145900     MOVE ZEROES               TO WRK-PAY-RATE1                   14190001
146000                                  WRK-PAY-RATE2                   14200001
146100                                  WRK-PAY-RATE3                   14210001
146200                                  WRK-PAY-RATE4.                  14220001
146300                                                                  14230001
146400 2013-EXIT. EXIT.                                                 14240001
146500                                                                  14250001
146600*----------------------------------------------------------****   14260001
146700*  FY 2014 PROCESS                                                14270001
146800*----------------------------------------------------------****   14280001
146900                                                                  14290001
147000 2014-PROCESS-DATA.                                               14300001
147100                                                                  14310001
147200     IF HLD-UNITS1 > 1000 OR                                      14320001
147300        HLD-UNITS2 > 1000 OR                                      14330001
147400        HLD-UNITS3 > 1000 OR                                      14340001
147500        HLD-UNITS4 > 1000                                         14350001
147600        MOVE '10'              TO HLD-RTC                         14360001
147700        GO TO 2014-EXIT.                                          14370003
147800                                                                  14380001
147900                                                                  14390001
148000     IF HLD-QIP-REDUCTION-IND = '1'                               14400001
148100        PERFORM 2014-APPLY-QIP                                    14410001
148200           THRU 2014-QIP-EXIT                                     14420001
148300     ELSE                                                         14430000
148400        PERFORM 2014-APPLY-NO-QIP                                 14440001
148500           THRU 2014-NO-QIP-EXIT.                                 14450001
148600                                                                  14460001
148700     COMPUTE HLD-PAY-AMT =                                        14470001
148800             WRK-PAY-RATE1 +                                      14480001
148900             WRK-PAY-RATE2 +                                      14490001
149000             WRK-PAY-RATE3 +                                      14500001
149100             WRK-PAY-RATE4.                                       14510001
149200                                                                  14520001
149300                                                                  14530001
149400     MOVE WRK-PAY-RATE1        TO  HLD-THEIR-PAY-CHG1.            14540001
149500     MOVE WRK-PAY-RATE2        TO  HLD-THEIR-PAY-CHG2.            14550001
149600     MOVE WRK-PAY-RATE3        TO  HLD-THEIR-PAY-CHG3.            14560001
149700     MOVE WRK-PAY-RATE4        TO  HLD-THEIR-PAY-CHG4.            14570001
149800                                                                  14580001
149900                                                                  14590001
150000     MOVE ZEROES               TO WRK-PAY-RATE1                   14600001
150100                                  WRK-PAY-RATE2                   14610001
150200                                  WRK-PAY-RATE3                   14620001
150300                                  WRK-PAY-RATE4.                  14630001
150400                                                                  14640001
150500 2014-EXIT. EXIT.                                                 14650001
150600                                                                  14660001
150700 2014-APPLY-NO-QIP.                                               14670001
150800                                                                  14680001
150900****=====================                                         14690001
151000****    QIP IND = '  '                                            14700001
151100****=====================                                         14710001
151200****    CALCULATE HOME RATE BY REVENUE CODE (NO QIP REDUCTION)    14720001
151300****    CALCULATE HOME RATE BY REVENUE CODE (NO QIP REDUCTION)    14730001
151400                                                                  14740001
151500                                                                  14750001
151600     IF HLD-REV1  = '0651'                                        14760001
151700        COMPUTE WRK-PAY-RATE1 ROUNDED =                           14770001
151800            ((107.23 * HLD-BENE-WAGE-IND) + 48.83) * HLD-UNITS1.  14780003
151900                                                                  14790001
152000                                                                  14800001
152100                                                                  14810001
152200                                                                  14820001
152300     IF HLD-REV2  = '0652'                                        14830001
152400        IF HLD-UNITS2 > 0                                         14840001
152500           IF HLD-UNITS2 < 32                                     14850001
152600             COMPUTE WRK-PAY-RATE2 ROUNDED =                      14860001
152700               ((107.23 * HLD-BENE-WAGE-IND) + 48.83)             14870003
152800           ELSE                                                   14880001
152900             COMPUTE WRK-PAY-RATE2 ROUNDED =                      14890001
153000               (((625.80 * HLD-BENE-WAGE-IND)                     14900003
153100                      + 284.98) / 24) * (HLD-UNITS2 / 4).         14910003
153200                                                                  14920001
153300                                                                  14930001
153400                                                                  14940001
153500     IF HLD-REV3  = '0655'                                        14950001
153600        COMPUTE WRK-PAY-RATE3 ROUNDED =                           14960001
153700            ((87.38 * HLD-PROV-WAGE-IND) + 74.04) * HLD-UNITS3.   14970003
153800                                                                  14980001
153900                                                                  14990001
154000                                                                  15000001
154100                                                                  15010001
154200     IF HLD-REV4  = '0656'                                        15020001
154300        COMPUTE WRK-PAY-RATE4 ROUNDED =                           15030001
154400            ((444.35 * HLD-PROV-WAGE-IND) + 249.84) * HLD-UNITS4. 15040003
154500                                                                  15050001
154600                                                                  15060001
154700 2014-NO-QIP-EXIT. EXIT.                                          15070001
154800                                                                  15080001
154900                                                                  15090001
155000 2014-APPLY-QIP.                                                  15100001
155100                                                                  15110001
155200****=====================                                         15120001
155300****    QIP IND = '1'    >> PAYMENT RATE IS LOWER                 15130001
155400****=====================                                         15140001
155500****    CALCULATE HOME RATE BY REVENUE CODE (WITH QIP REDUCTION)  15150001
155600****    CALCULATE HOME RATE BY REVENUE CODE (WITH QIP REDUCTION)  15160001
155700                                                                  15170001
155800     IF HLD-REV1  = '0651'                                        15180001
155900        COMPUTE WRK-PAY-RATE1 ROUNDED =                           15190001
156000            ((105.12 * HLD-BENE-WAGE-IND) + 47.87) * HLD-UNITS1.  15200003
156100                                                                  15210001
156200     IF HLD-REV2  = '0652'                                        15220001
156300        IF HLD-UNITS2 > 0                                         15230001
156400           IF HLD-UNITS2 < 32                                     15240001
156500             COMPUTE WRK-PAY-RATE2 ROUNDED =                      15250001
156600               ((105.12 * HLD-BENE-WAGE-IND) + 47.87)             15260003
156700           ELSE                                                   15270001
156800             COMPUTE WRK-PAY-RATE2 ROUNDED =                      15280001
156900               (((613.49 * HLD-BENE-WAGE-IND)                     15290003
157000                      + 279.38) / 24) * (HLD-UNITS2 / 4).         15300003
157100                                                                  15310001
157200     IF HLD-REV3  = '0655'                                        15320001
157300        COMPUTE WRK-PAY-RATE3 ROUNDED =                           15330001
157400            ((85.66 * HLD-PROV-WAGE-IND) + 72.58) * HLD-UNITS3.   15340003
157500                                                                  15350001
157600     IF HLD-REV4  = '0656'                                        15360001
157700        COMPUTE WRK-PAY-RATE4 ROUNDED =                           15370001
157800            ((435.61 * HLD-PROV-WAGE-IND) + 244.93) * HLD-UNITS4. 15380003
157900                                                                  15390001
158000                                                                  15400001
158100 2014-QIP-EXIT. EXIT.                                             15410001
158200                                                                  15420001
158300 2015-PROCESS-DATA.                                               15430001
158400                                                                  15440001
158500     IF HLD-UNITS1 > 1000 OR                                      15450001
158600        HLD-UNITS2 > 1000 OR                                      15460001
158700        HLD-UNITS3 > 1000 OR                                      15470001
158800        HLD-UNITS4 > 1000                                         15480001
158900        MOVE '10'              TO HLD-RTC                         15490001
159000        GO TO 2015-EXIT.                                          15500003
159100                                                                  15510001
159200                                                                  15520001
159300     IF HLD-QIP-REDUCTION-IND = '1'                               15530001
159400        PERFORM 2015-APPLY-QIP                                    15540001
159500           THRU 2015-QIP-EXIT                                     15550001
159600     ELSE                                                         15560000
159700        PERFORM 2015-APPLY-NO-QIP                                 15570001
159800           THRU 2015-NO-QIP-EXIT.                                 15580001
159900                                                                  15590001
160000     COMPUTE HLD-PAY-AMT =                                        15600001
160100             WRK-PAY-RATE1 +                                      15610001
160200             WRK-PAY-RATE2 +                                      15620001
160300             WRK-PAY-RATE3 +                                      15630001
160400             WRK-PAY-RATE4.                                       15640001
160500                                                                  15650001
160600                                                                  15660001
160700     MOVE WRK-PAY-RATE1        TO  HLD-THEIR-PAY-CHG1.            15670001
160800     MOVE WRK-PAY-RATE2        TO  HLD-THEIR-PAY-CHG2.            15680001
160900     MOVE WRK-PAY-RATE3        TO  HLD-THEIR-PAY-CHG3.            15690001
161000     MOVE WRK-PAY-RATE4        TO  HLD-THEIR-PAY-CHG4.            15700001
161100                                                                  15710001
161200                                                                  15720001
161300     MOVE ZEROES               TO WRK-PAY-RATE1                   15730001
161400                                  WRK-PAY-RATE2                   15740001
161500                                  WRK-PAY-RATE3                   15750001
161600                                  WRK-PAY-RATE4.                  15760001
161700                                                                  15770001
161800 2015-EXIT. EXIT.                                                 15780001
161900                                                                  15790001
162000 2015-APPLY-NO-QIP.                                               15800001
162100                                                                  15810001
162200****=====================                                         15820001
162300****    QIP IND = '  '   PAYMENT RATE IS HIGHER  (TABLE 1)        15830001
162400****=====================                                         15840001
162500****    CALCULATE HOME RATE BY REVENUE CODE (NO QIP REDUCTION)    15850001
162600****    CALCULATE HOME RATE BY REVENUE CODE (NO QIP REDUCTION)    15860001
162700                                                                  15870001
162800                                                                  15880001
162900     IF HLD-REV1  = '0651'                                        15890001
163000        COMPUTE WRK-PAY-RATE1 ROUNDED =                           15900001
163100            ((109.48 * HLD-BENE-WAGE-IND) + 49.86) * HLD-UNITS1.  15910003
163200                                                                  15920001
163300                                                                  15930001
163400     IF HLD-REV2  = '0652'                                        15940001
163500        IF HLD-UNITS2 > 0                                         15950001
163600           IF HLD-UNITS2 < 32                                     15960001
163700             COMPUTE WRK-PAY-RATE2 ROUNDED =                      15970001
163800               ((109.48 * HLD-BENE-WAGE-IND) + 49.86)             15980003
163900           ELSE                                                   15990001
164000             COMPUTE WRK-PAY-RATE2 ROUNDED =                      16000001
164100               (((638.94 * HLD-BENE-WAGE-IND)                     16010003
164200                      + 290.97) / 24) * (HLD-UNITS2 / 4).         16020003
164300                                                                  16030001
164400                                                                  16040001
164500     IF HLD-REV3  = '0655'                                        16050001
164600        COMPUTE WRK-PAY-RATE3 ROUNDED =                           16060001
164700            ((89.21 * HLD-PROV-WAGE-IND) + 75.60) * HLD-UNITS3.   16070003
164800                                                                  16080001
164900                                                                  16090001
165000                                                                  16100001
165100                                                                  16110001
165200     IF HLD-REV4  = '0656'                                        16120001
165300        COMPUTE WRK-PAY-RATE4 ROUNDED =                           16130001
165400            ((453.68 * HLD-PROV-WAGE-IND) + 255.09) * HLD-UNITS4. 16140003
165500                                                                  16150001
165600                                                                  16160001
165700 2015-NO-QIP-EXIT. EXIT.                                          16170001
165800                                                                  16180001
165900                                                                  16190001
166000 2015-APPLY-QIP.                                                  16200001
166100                                                                  16210001
166200                                                                  16220001
166300****=====================                                         16230001
166400****    QIP IND = '1'    >> PAYMENT RATE IS LOWER (TABLE 2)       16240001
166500****=====================                                         16250001
166600****    CALCULATE HOME RATE BY REVENUE CODE (WITH QIP REDUCTION)  16260001
166700****    CALCULATE HOME RATE BY REVENUE CODE (WITH QIP REDUCTION)  16270001
166800                                                                  16280001
166900     IF HLD-REV1  = '0651'                                        16290001
167000        COMPUTE WRK-PAY-RATE1 ROUNDED =                           16300001
167100            ((107.34 * HLD-BENE-WAGE-IND) + 48.88) * HLD-UNITS1.  16310003
167200                                                                  16320001
167300     IF HLD-REV2  = '0652'                                        16330001
167400        IF HLD-UNITS2 > 0                                         16340001
167500           IF HLD-UNITS2 < 32                                     16350001
167600             COMPUTE WRK-PAY-RATE2 ROUNDED =                      16360001
167700               ((107.34 * HLD-BENE-WAGE-IND) + 48.88)             16370003
167800           ELSE                                                   16380001
167900             COMPUTE WRK-PAY-RATE2 ROUNDED =                      16390001
168000               (((626.42 * HLD-BENE-WAGE-IND)                     16400003
168100                      + 285.27) / 24) * (HLD-UNITS2 / 4).         16410003
168200                                                                  16420001
168300     IF HLD-REV3  = '0655'                                        16430001
168400        COMPUTE WRK-PAY-RATE3 ROUNDED =                           16440001
168500            ((87.46 * HLD-PROV-WAGE-IND) + 74.12) * HLD-UNITS3.   16450003
168600                                                                  16460001
168700     IF HLD-REV4  = '0656'                                        16470001
168800        COMPUTE WRK-PAY-RATE4 ROUNDED =                           16480001
168900            ((444.79 * HLD-PROV-WAGE-IND) + 250.09) * HLD-UNITS4. 16490003
169000                                                                  16500001
169100                                                                  16510001
169200 2015-QIP-EXIT. EXIT.                                             16520001
169300                                                                  16530001
169400 2016-PROCESS-DATA.                                               16540001
169500                                                                  16550001
169600     IF HLD-UNITS1 > 1000 OR                                      16560001
169700        HLD-UNITS2 > 1000 OR                                      16570001
169800        HLD-UNITS3 > 1000 OR                                      16580001
169900        HLD-UNITS4 > 1000                                         16590001
170000        MOVE '10'              TO HLD-RTC                         16600001
170100        GO TO 2016-EXIT.                                          16610003
170200                                                                  16620001
170300                                                                  16630001
170400     IF HLD-QIP-REDUCTION-IND = '1'                               16640001
170500        PERFORM 2016-APPLY-QIP                                    16650001
170600           THRU 2016-QIP-EXIT                                     16660001
170700     ELSE                                                         16670000
170800        PERFORM 2016-APPLY-NO-QIP                                 16680001
170900           THRU 2016-NO-QIP-EXIT.                                 16690001
171000                                                                  16700001
171100     COMPUTE HLD-PAY-AMT =                                        16710001
171200             WRK-PAY-RATE1 +                                      16720001
171300             WRK-PAY-RATE2 +                                      16730001
171400             WRK-PAY-RATE3 +                                      16740001
171500             WRK-PAY-RATE4.                                       16750001
171600                                                                  16760001
171700                                                                  16770001
171800     MOVE WRK-PAY-RATE1        TO  HLD-THEIR-PAY-CHG1.            16780001
171900     MOVE WRK-PAY-RATE2        TO  HLD-THEIR-PAY-CHG2.            16790001
172000     MOVE WRK-PAY-RATE3        TO  HLD-THEIR-PAY-CHG3.            16800001
172100     MOVE WRK-PAY-RATE4        TO  HLD-THEIR-PAY-CHG4.            16810001
172200                                                                  16820001
172300                                                                  16830001
172400     MOVE ZEROES               TO WRK-PAY-RATE1                   16840001
172500                                  WRK-PAY-RATE2                   16850001
172600                                  WRK-PAY-RATE3                   16860001
172700                                  WRK-PAY-RATE4.                  16870001
172800                                                                  16880001
172900 2016-EXIT. EXIT.                                                 16890001
173000                                                                  16900001
173100 2016-APPLY-NO-QIP.                                               16910001
180700                                                                  16911010
173200                                                                  16920001
173300****=====================                                         16930001
173400****    QIP IND = '  '   PAYMENT RATE IS HIGHER  (TABLE 1)        16940001
173500****=====================                                         16950001
173600****    CALCULATE HOME RATE BY REVENUE CODE (NO QIP REDUCTION)    16960001
173700****    CALCULATE HOME RATE BY REVENUE CODE (NO QIP REDUCTION)    16970001
173800                                                                  16980001
173900****============================================================  16990001
174000****    RHC - ROUTINE HOME CARE = REVENUE CODE = 0651             17000001
174100****============================================================  17010001
174200                                                                  17020001
174300                                                                  17030001
174400     IF HLD-REV1  = '0651'                                        17040001
174500        COMPUTE WRK-PAY-RATE1 ROUNDED =                           17050001
174700     ((2016-RHC-LS-RATE * HLD-BENE-WAGE-IND)                      17060007
174700        + 2016-RHC-NLS-RATE)  * HLD-UNITS1.                       17070007
174300                                                                  17080007
174300                                                                  17090007
174900****============================================================  17100007
175000****    CHC - CONTINUOUS HOME CARE = REVENUE CODE = 0652          17110007
175100****============================================================  17120007
175200                                                                  17130007
182300     IF HLD-REV2  = '0652'                                        17140007
182400        IF HLD-UNITS2 > 0                                         17150007
182500           IF HLD-UNITS2 < 32                                     17160007
182600             COMPUTE WRK-PAY-RATE2 ROUNDED =                      17170007
178100              ((2016-RHC-LS-RATE * HLD-BENE-WAGE-IND)             17180007
178200                  + 2016-RHC-NLS-RATE)                            17190007
182800           ELSE                                                   17200007
182900             COMPUTE WRK-PAY-RATE2 ROUNDED =                      17210007
183000              (((2016-CHC-LS-RATE *  HLD-BENE-WAGE-IND)           17220007
183100                  + 2016-CHC-NLS-RATE) / 24) * (HLD-UNITS2 / 4).  17230008
183200                                                                  17240007
175300                                                                  17250007
176300                                                                  17260001
176400****============================================================  17270001
176500****    IRC - INPATIENT RESPITE CARE = REVENUE CODE = 0655        17280001
176600****============================================================  17290001
176700                                                                  17300001
176800                                                                  17310001
183900     IF HLD-REV3  = '0655'                                        17320007
184000        COMPUTE WRK-PAY-RATE3 ROUNDED =                           17330007
178100            ((2016-IRC-LS-RATE * HLD-PROV-WAGE-IND)               17340007
178200                  + 2016-IRC-NLS-RATE) *  HLD-UNITS3.             17350007
183700                                                                  17360007
177200                                                                  17370001
177300                                                                  17380001
177400****============================================================  17390001
177500****    GIC - GENERAL INPATIENT CARE = REVENUE CODE = 0656        17400001
177600****============================================================  17410001
177700                                                                  17420001
177800                                                                  17430001
177900     IF HLD-REV4  = '0656'                                        17440001
178000        COMPUTE WRK-PAY-RATE4 ROUNDED =                           17450001
178100            ((2016-GIC-LS-RATE * HLD-PROV-WAGE-IND)               17460003
178200                  + 2016-GIC-NLS-RATE) *  HLD-UNITS4.             17470003
178300                                                                  17480003
178600 2016-NO-QIP-EXIT. EXIT.                                          17490001
178700                                                                  17500001
180500                                                                  17510001
180600 2016-APPLY-QIP.                                                  17520001
180700                                                                  17530001
066700*                                                                 17536010
180800                                                                  17540001
180900****=====================                                         17550001
181000****    QIP IND = '1'    >> PAYMENT RATE IS LOWER (TABLE 2)       17560001
181100****=====================                                         17570001
181200****    CALCULATE HOME RATE BY REVENUE CODE (WITH QIP REDUCTION)  17580001
181300****    CALCULATE HOME RATE BY REVENUE CODE (WITH QIP REDUCTION)  17590001
181400                                                                  17600001
181500     IF HLD-REV1  = '0651'                                        17610001
181600        COMPUTE WRK-PAY-RATE1 ROUNDED =                           17620001
178100            ((2016-RHC-LS-RATE-Q * HLD-BENE-WAGE-IND)             17630007
178200                  + 2016-RHC-NLS-RATE-Q) *  HLD-UNITS1.           17640007
181800                                                                  17650001
181900****============================================================  17660001
182000****    CHC - CONTINUOUS HOME CARE = REVENUE CODE = 0652          17670001
182100****============================================================  17680001
182200                                                                  17690001
182300     IF HLD-REV2  = '0652'                                        17700001
182400        IF HLD-UNITS2 > 0                                         17710001
182500           IF HLD-UNITS2 < 32                                     17720001
182600             COMPUTE WRK-PAY-RATE2 ROUNDED =                      17730001
178100              ((2016-RHC-LS-RATE-Q * HLD-BENE-WAGE-IND)           17740007
178200                  + 2016-RHC-NLS-RATE-Q)                          17750007
182800           ELSE                                                   17760001
182900             COMPUTE WRK-PAY-RATE2 ROUNDED =                      17770001
183000              (((2016-CHC-LS-RATE-Q * HLD-BENE-WAGE-IND)          17780008
183100                + 2016-CHC-NLS-RATE-Q) / 24) * (HLD-UNITS2 / 4).  17790009
183200                                                                  17800003
183300                                                                  17810003
183400****============================================================  17820001
183500****    IRC - INPATIENT RESPITE CARE = REVENUE CODE = 0655        17830001
183600****============================================================  17840001
183800                                                                  17850001
183900     IF HLD-REV3  = '0655'                                        17860001
184000        COMPUTE WRK-PAY-RATE3 ROUNDED =                           17870001
178100            ((2016-IRC-LS-RATE-Q * HLD-PROV-WAGE-IND)             17880007
178200                  + 2016-IRC-NLS-RATE-Q) *  HLD-UNITS3.           17890007
183700                                                                  17900007
184200                                                                  17910001
184300****============================================================  17920001
184400****    GIC - GENERAL INPATIENT CARE = REVENUE CODE = 0656        17930001
184500****============================================================  17940001
184600                                                                  17950001
177800                                                                  17960007
177900     IF HLD-REV4  = '0656'                                        17970007
178000        COMPUTE WRK-PAY-RATE4 ROUNDED =                           17980007
178100            ((2016-GIC-LS-RATE-Q * HLD-PROV-WAGE-IND)             17990007
178200                  + 2016-GIC-NLS-RATE-Q) *  HLD-UNITS4.           18000007
178300                                                                  18010007
185100                                                                  18020001
185200 2016-QIP-EXIT. EXIT.                                             18030001
185300*----------------------------------------------------------****   18040001
185400******        L A S T   S O U R C E   S T A T E M E N T   *****   18050001
