000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.           HOSPR140.                                  00020000
000300*AUTHOR.  BARBARA KUNKEL                                          00030000
000400*         (CENTERS FOR MEDICARE AND MEDICAID SERVICES)            00040000
000500*REMARKS. A). HOSPICE PRICER                                      00050000
000600******************************************************************00060000
000700*REMARKS.                                                         00070000
000800*     HOSPR140   REVISIONS FOR OCT 1, 2013                        00080000
000900*                REVISED BILL & RATE RECORD LENGTH FROM 135 TO 25000090001
000900*                NEW LOGIC FOR QIP INDICATOR                      00090001
001100*     HOSDR140   NEW PROCEESS OCT 1, 2013                         00090100
001200*                CBSA FILE PROCESSING DRIVER CALL HOSPR140        00090200
001300*     HOSOP140   NEW PROCEESS OCT 1, 2013                         00090300
001400*                CICS VERSION TO OPEN FILES CALL HOSDR140         00090400
001500*                                                                 00090500
000800*     HOSPR130   REVISIONS FOR OCT 1, 2012                        00080000
000900*                REVISED GO TO EXIT LOGIC FOR 2007, 7-1, 8 AND 9  00090001
000900*                        FOR 2007, 7-1, 8 AND 9                   00090001
001100*     HOSDR130   NEW PROCEESS OCT 1, 2012                         00090100
001200*                CBSA FILE PROCESSING DRIVER CALL HOSPR130        00090200
001300*     HOSOP130   NEW PROCEESS OCT 1, 2012                         00090300
001400*                CICS VERSION TO OPEN FILES CALL HOSDR130         00090400
001500*                                                                 00090500
000800*     HOSPR120   REVISIONS FOR OCT 1, 2011                        00080000
000900*                REVISED GO TO EXIT LOGIC FOR 2007, 7-1, 8 AND 9  00090001
000900*                        FOR 2007, 7-1, 8 AND 9                   00090001
001100*     HOSDR120   NEW PROCEESS OCT 1, 2011                         00090100
001200*                CBSA FILE PROCESSING DRIVER CALL HOSPR120        00090200
001300*     HOSOP120   NEW PROCEESS OCT 1, 2011                         00090300
001400*                CICS VERSION TO OPEN FILES CALL HOSDR120         00090400
001500*                                                                 00090500
000800*     HOSPR110   REVISIONS FOR OCT 1, 2010                        00080000
000900*                REVISED GO TO EXIT LOGIC FOR 2007, 7-1, 8 AND 9  00090001
001100*     HOSDR110   NEW PROCEESS OCT 1, 2010                         00090100
001200*                CBSA FILE PROCESSING DRIVER CALL HOSPR110        00090200
001300*     HOSOP110   NEW PROCEESS OCT 1, 2010                         00090300
001400*                CICS VERSION TO OPEN FILES CALL HOSDR110         00090400
001500*                                                                 00090500
000800*     HOSPR100   REVISIONS FOR OCT 1, 2009                        00080000
000900*                REVISED GO TO EXIT LOGIC FOR 2007, 7-1, 8 AND 9  00090001
001100*     HOSDR100   NEW PROCEESS OCT 1, 2009                         00090100
001200*                CBSA FILE PROCESSING DRIVER CALL HOSPR100        00090200
001300*     HOSOP100   NEW PROCEESS OCT 1, 2009                         00090300
001400*                CICS VERSION TO OPEN FILES CALL HOSDR100         00090400
001500*                                                                 00090500
001600*     HOSPR091   REVISIONS FOR OCT 1, 2008                        00080000
001700*                REVISED GO TO EXIT LOGIC FOR 2007, 7-1, 8 AND 9  00090001
001800*                STIMULUS PKG RECOMPILE                           00090001
001900*     HOSDR091   NEW PROCEESS OCT 1, 2008                         00090100
002000*                CBSA FILE PROCESSING DRIVER CALL HOSPR091        00090200
002100*     HOSOP091   NEW PROCEESS OCT 1, 2008                         00090300
002200*                CICS VERSION TO OPEN FILES CALL HOSDR091         00090400
002300*                                                                 00090500
002400*     HOSPR090   REVISIONS FOR OCT 1, 2008                        00090510
002500*                REVISED PAYMENT RATES FOR FY2009                 00090520
002600*     HOSDR090   NEW PROCEESS OCT 1, 2008                         00090530
002700*                CBSA FILE PROCESSING DRIVER CALL HOSPR090        00090540
002800*     HOSOP090   NEW PROCEESS OCT 1, 2008                         00090550
002900*                CICS VERSION TO OPEN FILES CALL HOSDR090         00090560
003000*                                                                 00090570
003100*     HOSPR081   REVISIONS FOR OCT 1, 2007                        00090600
003200*                REVISED PAYMENT RATES FOR FY2008                 00090700
003300*     HOSDR081   NEW PROCEESS OCT 1, 2007                         00090800
003400*                CBSA FILE PROCESSING DRIVER CALL HOSPR081        00090900
003500*     HOSOP081   NEW PROCEESS OCT 1, 2007                         00091000
003600*                CICS VERSION TO OPEN FILES CALL HOSDR081         00091100
003700*                                                                 00091200
003800*     HOSPR071   REVISIONS FOR JAN 1, 2007                        00091300
003900*                2007-CHANGE TO UNITS = 15 MINUTES CODE 652.      00091400
004000*     HOSDR071   NEW PROCEESS JAN 1, 2007                         00091500
004100*                CBSA FILE PROCESSING DRIVER CALL HOSPR071        00091600
004200*     HOSOP071   NEW PROCEESS JAN 1, 2007                         00091700
004300*                CICS VERSION TO OPEN FILES CALL HOSDR071         00091800
004400*                                                                 00091900
004500*     HOSPR070   REVISIONS FOR OCT 1, 2006                        00092000
004600*                2007-PROCESS-DATA                                00092100
004700*                2007 CALCULATE HOME RATE BY REVENUE CODE FACTORS 00092200
004800*     HOSDR070   NEW PROCEESS OCT 1, 2006                         00092300
004900*                CBSA FILE PROCESSING DRIVER                      00092400
005000*     HOSOP070   NEW PROCEESS OCT 1, 2006                         00092500
005100*                CICS VERSION TO OPEN FILES                       00092600
005200*                                                                 00092700
005300***************************************************************   00093000
005400******************************************************************00094000
005500***     WILL PROCESS CLAIMS  FOR 1998 THRU 2007                   00095000
005600***                ALL RATES FOR 1998 THRU 2007                   00096000
005700******************************************************************00097000
005800 DATE-COMPILED.                                                   00098000
005900 ENVIRONMENT DIVISION.                                            00099000
006000 CONFIGURATION SECTION.                                           00100000
006100 SOURCE-COMPUTER.            IBM-370.                             00110000
006200 OBJECT-COMPUTER.            IBM-370.                             00120000
006300 INPUT-OUTPUT  SECTION.                                           00140000
006400 FILE-CONTROL.                                                    00140000
006500                                                                  00150000
006600                                                                  00160000
006700 DATA DIVISION.                                                   00170000
006800 FILE SECTION.                                                    00180000
006900                                                                  00190000
007000                                                                  00200000
007100 WORKING-STORAGE SECTION.                                         00210000
007200 01  W-STORAGE-REF                  PIC X(46)  VALUE              00220000
007300     'HOSPR140      - W O R K I N G   S T O R A G E'.             00230000
007400 01  HOS-VERSION                    PIC X(09)  VALUE 'HOSPR14.0'. 00240000
007500 01  WRK-PAY-RATE1                  PIC 9(06)V9(02) VALUE 0.      00250000
007600 01  WRK-PAY-RATE2                  PIC 9(06)V9(02) VALUE 0.      00260000
007700 01  WRK-PAY-RATE3                  PIC 9(06)V9(02) VALUE 0.      00270000
007800 01  WRK-PAY-RATE4                  PIC 9(06)V9(02) VALUE 0.      00280000
007900                                                                  00290000
008000                                                                  00300000
008100                                                                  00310000
008200 LINKAGE SECTION.                                                 00320000
008300***************************************************************   00330000
008400*                 * * * * * * * * *                           *   00340000
008500***************************************************************   00350000
008600***************************************************************   00360000
008700*    THIS DATA IS CALCULATED BY THIS HOSPRICER PROGRAM        *   00370000
008800*    AND PASSED BACK                                          *   00380000
008900*            RETURN CODE VALUES (HLD-RTC)                     *   00390000
009000*                                                             *   00400000
009100*            HLD-RTC                                          *   00410000
009200*              00 = HOME RATE RETURNED                        *   00420000
009300*                                                             *   00430000
009400*            HLD-RTC   NO RATE RETURNED                       *   00440000
009500*              10 = BAD UNITS                                 *   00450000
009600*                                                             *   00460000
009700*              20 = BAD UNITS2 < 8                            *   00470000
009800*                                                             *   00480000
009900*              30 = BAD MSA CODE                              *   00490000
010000*                                                             *   00500000
010100*              40 = BAD HOSPICE WAGE INDEX FROM MSAFILE       *   00510000
010200*                                                             *   00520000
010300*              50 = BAD BENE    WAGE INDEX FROM MSAFILE       *   00530000
010400*                                                             *   00540000
010500*              51 = BAD PROV NUMBER                           *   00550000
010600*                                                             *   00560000
010700***************************************************************   00570000
037800
014800***************************************************************   00980000
039100 01  HOLD-BILL-DATA.
039200     10  HLD-NPI                  PIC X(10).
039300     10  HLD-PROV-NO              PIC X(06).
039400     10  HLD-FROM-DATE-ALL.
039500         15  HLD-FROM-CC          PIC 99.
039600         15  HLD-FROM-DATE.
039700             20  HLD-FROM-YY      PIC 99.
039800             20  HLD-FROM-MM      PIC 99.
039900             20  HLD-FROM-DD      PIC 99.
040000*
035700     10  FILLER                   PIC X(08).
040000*
040100     10  HLD-PROV-MSA-LUGAR.
040200         15  HLD-PROV-MSA         PIC X(04).
040300         15  HLD-PROV-LUGAR       PIC X.
040400     10  HLD-PROV-CBSA REDEFINES
040500                       HLD-PROV-MSA-LUGAR PIC X(05).
040600*
040700     10  HLD-BENE-MSA-LUGAR.
040800         15  HLD-BENE-MSA         PIC X(04).
040900         15  HLD-BENE-LUGAR       PIC X.
041000     10  HLD-BENE-CBSA REDEFINES
041100                       HLD-BENE-MSA-LUGAR PIC X(05).
035500*
035700     10  FILLER                   PIC X(10).
041200*
041300     10  HLD-PROV-WAGE-IND        PIC 9(02)V9(04).
041400     10  HLD-BENE-WAGE-IND        PIC 9(02)V9(04).
035500*
035700     10  FILLER                   PIC X(20).
035500*
035700     10  HLD-QIP-REDUCTION-IND    PIC X.
035500*
041500     10  HLD-GROUP1.
041600         15  HLD-REV1             PIC XXXX.
036000         15  HLD-HCPC1            PIC X(05).
041700         15  HLD-UNITS1           PIC 9(07).
041800         15  HLD-THEIR-PAY-CHG1   PIC 9(06)V99.
041900     10  HLD-GROUP2.
042000         15  HLD-REV2             PIC XXXX.
036000         15  HLD-HCPC2            PIC X(05).
042100         15  HLD-UNITS2           PIC 9(07).
042200         15  HLD-THEIR-PAY-CHG2   PIC 9(06)V99.
042300     10  HLD-GROUP3.
042400         15  HLD-REV3             PIC XXXX.
036000         15  HLD-HCPC3            PIC X(05).
042500         15  HLD-UNITS3           PIC 9(07).
042600         15  HLD-THEIR-PAY-CHG3   PIC 9(06)V99.
042700     10  HLD-GROUP4.
042800         15  HLD-REV4             PIC XXXX.
036000         15  HLD-HCPC4            PIC X(05).
042900         15  HLD-UNITS4           PIC 9(07).
043000         15  HLD-THEIR-PAY-CHG4   PIC 9(06)V99.
043100     10  HLD-RETURNED-DATA.
043200         15  HLD-PAY-AMT          PIC 9(06)V99.
043300         15  HLD-RTC              PIC XX.
043400     10  FILLER                   PIC X(24).
043500
043600***************************************************************
014900*----------------------------------------------------------****   00990000
014700 PROCEDURE DIVISION USING HOLD-BILL-DATA.                         00970000
014800***************************************************************   00980000
014900*----------------------------------------------------------****   00990000
015000                                                                  01000000
015100     MOVE ALL '0'              TO HLD-RETURNED-DATA               01010000
015200                                  HLD-THEIR-PAY-CHG1              01020000
015300                                  HLD-THEIR-PAY-CHG2              01030000
015400                                  HLD-THEIR-PAY-CHG3              01040000
015500                                  HLD-THEIR-PAY-CHG4.             01050000
015600                                                                  01060000
015700*----------------------------------------------------------****   01070000
015800*  FY 2014 PROCESS                                                01080001
015900*----------------------------------------------------------****   01081000
016000                                                                  01082000
016100     IF HLD-FROM-DATE-ALL > 20130930                              01083001
016200        PERFORM 2014-PROCESS-DATA                                 01084001
016200           THRU 2014-EXIT                                         01084001
016300        GOBACK.                                                   01085000
016400                                                                  01086000
015700*----------------------------------------------------------****   01070000
015800*  FY 2013 PROCESS                                                01080001
015900*----------------------------------------------------------****   01081000
016000                                                                  01082000
016100     IF HLD-FROM-DATE-ALL > 20120930                              01083001
016200        PERFORM 2013-PROCESS-DATA                                 01084001
016200           THRU 2013-EXIT                                         01084001
016300        GOBACK.                                                   01085000
016400                                                                  01086000
015700*----------------------------------------------------------****   01070000
015800*  FY 2012 PROCESS                                                01080001
015900*----------------------------------------------------------****   01081000
016000                                                                  01082000
016100     IF HLD-FROM-DATE-ALL > 20110930                              01083001
016200        PERFORM 2012-PROCESS-DATA                                 01084001
016200           THRU 2012-EXIT                                         01084001
016300        GOBACK.                                                   01085000
016400                                                                  01086000
015700*----------------------------------------------------------****   01070000
015800*  FY 2011 PROCESS                                                01080001
015900*----------------------------------------------------------****   01081000
016000                                                                  01082000
016100     IF HLD-FROM-DATE-ALL > 20100930                              01083001
016200        PERFORM 2011-PROCESS-DATA                                 01084001
016200           THRU 2011-EXIT                                         01084001
016300        GOBACK.                                                   01085000
016400                                                                  01086000
015700*----------------------------------------------------------****   01070000
015800*  FY 2010 PROCESS                                                01080001
015900*----------------------------------------------------------****   01081000
016000                                                                  01082000
016100     IF HLD-FROM-DATE-ALL > 20090930                              01083001
016200        PERFORM 2010-PROCESS-DATA                                 01084001
016200           THRU 2010-EXIT                                         01084001
016300        GOBACK.                                                   01085000
016400                                                                  01086000
016500*----------------------------------------------------------****   01070000
016600*  FY 2009 PROCESS                                                01080001
016700*----------------------------------------------------------****   01081000
016800                                                                  01082000
016900     IF HLD-FROM-DATE-ALL > 20080930                              01083001
017000        PERFORM 2009-PROCESS-DATA                                 01084001
016200           THRU 2009-EXIT                                         01084001
017100        GOBACK.                                                   01085000
017200                                                                  01086000
017300*----------------------------------------------------------****   01086101
017400*  FY 2008 PROCESS                                                01086201
017500*----------------------------------------------------------****   01086301
017600                                                                  01086401
017700     IF HLD-FROM-DATE-ALL > 20070930                              01086501
017800        PERFORM 2008-PROCESS-DATA                                 01086601
016200           THRU 2008-EXIT                                         01084001
017900        GOBACK.                                                   01086701
018000                                                                  01086801
018100*----------------------------------------------------------****   01087000
018200*  FY 2007.1 PROCESS                                              01088000
018300*----------------------------------------------------------****   01089000
018400                                                                  01090000
018500     IF HLD-FROM-DATE-ALL > 20061231                              01100000
018600        PERFORM 2007-1-PROCESS-DATA                               01110000
016200           THRU 2007-1-EXIT                                       01084001
018700        GOBACK.                                                   01120000
018800                                                                  01130000
018900*----------------------------------------------------------****   01130100
019000*  FY 2007 PROCESS                                                01130200
019100*----------------------------------------------------------****   01130300
019200                                                                  01130400
019300     IF HLD-FROM-DATE-ALL > 20060930                              01130500
019400        PERFORM 2007-PROCESS-DATA                                 01130600
016200           THRU 2007-EXIT                                         01084001
019500        GOBACK.                                                   01130700
019600                                                                  01130800
019700*----------------------------------------------------------****   01130900
019800*  FY 2006 PROCESS                                                01131000
019900*----------------------------------------------------------****   01131100
020000                                                                  01131200
020100     IF HLD-FROM-DATE-ALL > 20050930                              01131300
020200        PERFORM 2006-PROCESS-DATA                                 01131400
016200           THRU 2006-EXIT                                         01084001
020300        GOBACK.                                                   01131500
020400                                                                  01131600
020500*----------------------------------------------------------****   01131700
020600*  FY 2005 PROCESS                                                01131800
020700*----------------------------------------------------------****   01131900
020800                                                                  01132000
020900     IF HLD-FROM-DATE-ALL > 20040930                              01133000
021000        PERFORM 2005-PROCESS-DATA                                 01133100
016200           THRU 2005-EXIT                                         01084001
021100        GOBACK.                                                   01133200
021200                                                                  01133300
021300*----------------------------------------------------------****   01133400
021400*  FY 2004 PROCESS                                                01133500
021500*----------------------------------------------------------****   01133600
021600                                                                  01133700
021700     IF HLD-FROM-DATE-ALL > 20030930                              01133800
021800        PERFORM 2004-PROCESS-DATA                                 01133900
016200           THRU 2004-EXIT                                         01084001
021900        GOBACK.                                                   01134000
022000                                                                  01135000
022100*----------------------------------------------------------****   01136000
022200*  FY 2003 PROCESS                                                01137000
022300*----------------------------------------------------------****   01138000
022400                                                                  01139000
022500     IF HLD-FROM-DATE-ALL > 20020930                              01140000
022600        PERFORM 2003-PROCESS-DATA                                 01150000
016200           THRU 2003-EXIT                                         01084001
022700        GOBACK.                                                   01160000
022800                                                                  01170000
022900*----------------------------------------------------------****   01180000
023000*  FY 2002 PROCESS                                                01190000
023100*----------------------------------------------------------****   01200000
023200                                                                  01210000
023300     IF HLD-FROM-DATE-ALL > 20010930                              01220000
023400        PERFORM 2002-PROCESS-DATA                                 01230000
016200           THRU 2002-EXIT                                         01084001
023500        GOBACK.                                                   01240000
023600                                                                  01250000
023700*----------------------------------------------------------****   01260000
023800*  FY 2001-A PROCESS                                              01270000
023900*----------------------------------------------------------****   01280000
024000                                                                  01290000
024100     IF HLD-FROM-DATE-ALL > 20010331                              01300000
024200        PERFORM 2001A-PROCESS-DATA                                01310000
016200           THRU 2001A-EXIT                                        01084001
024300        GOBACK.                                                   01320000
024400                                                                  01330000
024500*----------------------------------------------------------****   01340000
024600*  FY 2001 PROCESS                                                01350000
024700*----------------------------------------------------------****   01360000
024800                                                                  01370000
024900     IF HLD-FROM-DATE-ALL > 20000930                              01380000
025000        PERFORM 2001-PROCESS-DATA                                 01390000
016200           THRU 2001-EXIT                                         01084001
025100        GOBACK.                                                   01400000
025200                                                                  01410000
025300*----------------------------------------------------------****   01420000
025400*  FY 2000 PROCESS                                                01430000
025500*----------------------------------------------------------****   01440000
025600                                                                  01450000
025700     IF HLD-FROM-DATE-ALL > 19990930                              01460000
025800        PERFORM 2000-PROCESS-DATA                                 01470000
016200           THRU 2000-EXIT                                         01084001
025900        GOBACK.                                                   01480000
026000                                                                  01490000
026100*----------------------------------------------------------****   01500000
026200*  FY 1999 PROCESS                                                01510000
026300*----------------------------------------------------------****   01520000
026400                                                                  01530000
026500     IF HLD-FROM-DATE-ALL > 19980930                              01540000
026600        PERFORM 1999-PROCESS-DATA                                 01550000
016200           THRU 1999-EXIT                                         01084001
026700        GOBACK.                                                   01560000
026800                                                                  01570000
026900*----------------------------------------------------------****   01580000
027000*  FY 1998 PROCESS                                                01590000
027100*----------------------------------------------------------****   01600000
027200                                                                  01610000
027300     PERFORM 1998-PROCESS-DATA                                    01620000
016200        THRU 1998-EXIT                                            01084001
027400                                                                  01630000
027500     GOBACK.                                                      01640000
027600                                                                  01650000
027700*----------------------------------------------------------****   01660000
027800*  FY 1998 PROCESS                                                01670000
027900*----------------------------------------------------------****   01680000
028000                                                                  01690000
028100 1998-PROCESS-DATA.                                               01700000
028000                                                                  01690000
028200     IF HLD-UNITS1 > 1000 OR                                      01710000
028300        HLD-UNITS2 > 1000 OR                                      01720000
028400        HLD-UNITS3 > 1000 OR                                      01730000
028500        HLD-UNITS4 > 1000                                         01740000
028600        MOVE '10'              TO HLD-RTC                         01750000
028700        GO TO 1998-EXIT.                                          01760000
028800                                                                  01770000
028900     IF HLD-REV2  = '0652'                                        01780000
029000        IF HLD-UNITS2 < 8                                         01790000
029100           MOVE '20'           TO HLD-RTC                         01800000
029200           GO TO 1998-EXIT.                                       01810000
029300                                                                  01820000
029400****    CALCULATE HOME RATE BY REVENUE CODE                       01830000
029500****    CALCULATE HOME RATE BY REVENUE CODE                       01840000
029600                                                                  01850000
029700     IF HLD-REV1  = '0651'                                        01860000
029800        COMPUTE WRK-PAY-RATE1 ROUNDED =                           01870000
029900         ((65.80 * HLD-BENE-WAGE-IND) + 29.97) * HLD-UNITS1.      01880000
030000                                                                  01890000
030100     IF HLD-REV2  = '0652'                                        01900000
030200        COMPUTE WRK-PAY-RATE2 ROUNDED =                           01910000
030300         (((384.08 * HLD-BENE-WAGE-IND)                           01920000
030400                                   + 174.91) / 24) * HLD-UNITS2.  01930000
030500                                                                  01940000
030600     IF HLD-REV3  = '0655'                                        01950000
030700        COMPUTE WRK-PAY-RATE3 ROUNDED =                           01960000
030800         ((53.63 * HLD-PROV-WAGE-IND) + 45.44) * HLD-UNITS3.      01970000
030900                                                                  01980000
031000     IF HLD-REV4  = '0656'                                        01990000
031100        COMPUTE WRK-PAY-RATE4 ROUNDED =                           02000000
031200         ((272.71 * HLD-PROV-WAGE-IND) + 153.34) * HLD-UNITS4.    02010000
031300                                                                  02020000
031400     COMPUTE HLD-PAY-AMT =                                        02030000
031500             WRK-PAY-RATE1 +                                      02040000
031600             WRK-PAY-RATE2 +                                      02050000
031700             WRK-PAY-RATE3 +                                      02060000
031800             WRK-PAY-RATE4.                                       02070000
031900                                                                  02080000
032000     MOVE WRK-PAY-RATE1        TO HLD-THEIR-PAY-CHG1.             02090000
032100     MOVE WRK-PAY-RATE2        TO HLD-THEIR-PAY-CHG2.             02100000
032200     MOVE WRK-PAY-RATE3        TO HLD-THEIR-PAY-CHG3.             02110000
032300     MOVE WRK-PAY-RATE4        TO HLD-THEIR-PAY-CHG4.             02120000
032400                                                                  02130000
032500     MOVE ZEROES               TO WRK-PAY-RATE1                   02140000
032600                                  WRK-PAY-RATE2                   02150000
032700                                  WRK-PAY-RATE3                   02160000
032800                                  WRK-PAY-RATE4.                  02170000
032900                                                                  02180000
033000 1998-EXIT.  EXIT.                                                02190000
033100                                                                  02200000
033200*----------------------------------------------------------****   02210000
033300*  FY 1999 PROCESS                                                02220000
033400*----------------------------------------------------------****   02230000
033500                                                                  02240000
033600 1999-PROCESS-DATA.                                               02250000
033700     IF HLD-UNITS1 > 1000 OR                                      02260000
033800        HLD-UNITS2 > 1000 OR                                      02270000
033900        HLD-UNITS3 > 1000 OR                                      02280000
034000        HLD-UNITS4 > 1000                                         02290000
034100        MOVE '10'              TO HLD-RTC                         02300000
034200        GO TO 1999-EXIT.                                          02310000
034300                                                                  02320000
034400     IF HLD-REV2  = '0652'                                        02330000
034500        IF HLD-UNITS2 < 8                                         02340000
034600           MOVE '20'           TO HLD-RTC                         02350000
034700           GO TO 1999-EXIT.                                       02360000
034800                                                                  02370000
034900****    CALCULATE HOME RATE BY REVENUE CODE                       02380000
035000****    CALCULATE HOME RATE BY REVENUE CODE                       02390000
035100                                                                  02400000
035200     IF HLD-REV1  = '0651'                                        02410000
035300        COMPUTE WRK-PAY-RATE1 ROUNDED =                           02420000
035400         ((66.72 * HLD-BENE-WAGE-IND) + 30.39) * HLD-UNITS1.      02430000
035500                                                                  02440000
035600     IF HLD-REV2  = '0652'                                        02450000
035700        COMPUTE WRK-PAY-RATE2 ROUNDED =                           02460000
035800         (((389.46 * HLD-BENE-WAGE-IND)                           02470000
035900                                   + 177.36) / 24) * HLD-UNITS2.  02480000
036000                                                                  02490000
036100     IF HLD-REV3  = '0655'                                        02500000
036200        COMPUTE WRK-PAY-RATE3 ROUNDED =                           02510000
036300         ((54.38 * HLD-PROV-WAGE-IND) + 46.08) * HLD-UNITS3.      02520000
036400                                                                  02530000
036500     IF HLD-REV4  = '0656'                                        02540000
036600        COMPUTE WRK-PAY-RATE4 ROUNDED =                           02550000
036700         ((276.53 * HLD-PROV-WAGE-IND) + 155.48) * HLD-UNITS4.    02560000
036800                                                                  02570000
036900     COMPUTE HLD-PAY-AMT =                                        02580000
037000             WRK-PAY-RATE1 +                                      02590000
037100             WRK-PAY-RATE2 +                                      02600000
037200             WRK-PAY-RATE3 +                                      02610000
037300             WRK-PAY-RATE4.                                       02620000
037400                                                                  02630000
037500     MOVE WRK-PAY-RATE1        TO HLD-THEIR-PAY-CHG1.             02640000
037600     MOVE WRK-PAY-RATE2        TO HLD-THEIR-PAY-CHG2.             02650000
037700     MOVE WRK-PAY-RATE3        TO HLD-THEIR-PAY-CHG3.             02660000
037800     MOVE WRK-PAY-RATE4        TO HLD-THEIR-PAY-CHG4.             02670000
037900                                                                  02680000
038000                                                                  02690000
038100     MOVE ZEROES               TO WRK-PAY-RATE1                   02700000
038200                                  WRK-PAY-RATE2                   02710000
038300                                  WRK-PAY-RATE3                   02720000
038400                                  WRK-PAY-RATE4.                  02730000
038500                                                                  02740000
038600 1999-EXIT.  EXIT.                                                02750000
038700                                                                  02760000
038800*----------------------------------------------------------****   02770000
038900*  FY 2000 PROCESS                                                02780000
039000*----------------------------------------------------------****   02790000
039100                                                                  02800000
039200 2000-PROCESS-DATA.                                               02810000
039300     IF HLD-UNITS1 > 1000 OR                                      02820000
039400        HLD-UNITS2 > 1000 OR                                      02830000
039500        HLD-UNITS3 > 1000 OR                                      02840000
039600        HLD-UNITS4 > 1000                                         02850000
039700        MOVE '10'              TO HLD-RTC                         02860000
039800        GO TO 2000-EXIT.                                          02870000
039900                                                                  02880000
040000     IF HLD-REV2  = '0652'                                        02890000
040100        IF HLD-UNITS2 < 8                                         02900000
040200           MOVE '20'           TO HLD-RTC                         02910000
040300           GO TO 2000-EXIT.                                       02920000
040400                                                                  02930000
040500****    CALCULATE HOME RATE BY REVENUE CODE                       02940000
040600****    CALCULATE HOME RATE BY REVENUE CODE                       02950000
040700                                                                  02960000
040800     IF HLD-REV1  = '0651'                                        02970000
040900        COMPUTE WRK-PAY-RATE1 ROUNDED =                           02980000
041000         ((68.00 * HLD-BENE-WAGE-IND) + 30.96) * HLD-UNITS1.      02990000
041100                                                                  03000000
041200     IF HLD-REV2  = '0652'                                        03010000
041300        COMPUTE WRK-PAY-RATE2 ROUNDED =                           03020000
041400         (((396.86 * HLD-BENE-WAGE-IND)                           03030000
041500                                   + 180.73) / 24) * HLD-UNITS2.  03040000
041600                                                                  03050000
041700     IF HLD-REV3  = '0655'                                        03060000
041800        COMPUTE WRK-PAY-RATE3 ROUNDED =                           03070000
041900         ((55.41 * HLD-PROV-WAGE-IND) + 46.96) * HLD-UNITS3.      03080000
042000                                                                  03090000
042100     IF HLD-REV4  = '0656'                                        03100000
042200        COMPUTE WRK-PAY-RATE4 ROUNDED =                           03110000
042300         ((281.78 * HLD-PROV-WAGE-IND) + 158.44) * HLD-UNITS4.    03120000
042400                                                                  03130000
042500     COMPUTE HLD-PAY-AMT =                                        03140000
042600             WRK-PAY-RATE1 +                                      03150000
042700             WRK-PAY-RATE2 +                                      03160000
042800             WRK-PAY-RATE3 +                                      03170000
042900             WRK-PAY-RATE4.                                       03180000
043000                                                                  03190000
043100     MOVE WRK-PAY-RATE1        TO HLD-THEIR-PAY-CHG1.             03200000
043200     MOVE WRK-PAY-RATE2        TO HLD-THEIR-PAY-CHG2.             03210000
043300     MOVE WRK-PAY-RATE3        TO HLD-THEIR-PAY-CHG3.             03220000
043400     MOVE WRK-PAY-RATE4        TO HLD-THEIR-PAY-CHG4.             03230000
043500                                                                  03240000
043600                                                                  03250000
043700     MOVE ZEROES               TO WRK-PAY-RATE1                   03260000
043800                                  WRK-PAY-RATE2                   03270000
043900                                  WRK-PAY-RATE3                   03280000
044000                                  WRK-PAY-RATE4.                  03290000
044100                                                                  03300000
044200 2000-EXIT.  EXIT.                                                03310000
044300                                                                  03320000
044400*----------------------------------------------------------****   03330000
044500*  FY 2001 PROCESS                                                03340000
044600*----------------------------------------------------------****   03350000
044700                                                                  03360000
044800 2001-PROCESS-DATA.                                               03370000
044900     IF HLD-UNITS1 > 1000 OR                                      03380000
045000        HLD-UNITS2 > 1000 OR                                      03390000
045100        HLD-UNITS3 > 1000 OR                                      03400000
045200        HLD-UNITS4 > 1000                                         03410000
045300        MOVE '10' TO HLD-RTC                                      03420000
045400        GO TO 2001-EXIT.                                          03430000
045500                                                                  03440000
045600     IF HLD-REV2  = '0652'                                        03450000
045700        IF HLD-UNITS2 < 8                                         03460000
045800           MOVE '20' TO HLD-RTC                                   03470000
045900           GO TO 2001-EXIT.                                       03480000
046000                                                                  03490000
046100****    CALCULATE HOME RATE BY REVENUE CODE                       03500000
046200****    CALCULATE HOME RATE BY REVENUE CODE                       03510000
046300                                                                  03520000
046400     IF HLD-REV1  = '0651'                                        03530000
046500        COMPUTE WRK-PAY-RATE1 ROUNDED =                           03540000
046600         ((69.97 * HLD-BENE-WAGE-IND) + 31.87) * HLD-UNITS1.      03550000
046700                                                                  03560000
046800     IF HLD-REV2  = '0652'                                        03570000
046900        COMPUTE WRK-PAY-RATE2 ROUNDED =                           03580000
047000         (((408.42 * HLD-BENE-WAGE-IND)                           03590000
047100                                   + 185.99) / 24) * HLD-UNITS2.  03600000
047200                                                                  03610000
047300     IF HLD-REV3  = '0655'                                        03620000
047400        COMPUTE WRK-PAY-RATE3 ROUNDED =                           03630000
047500         ((57.03 * HLD-PROV-WAGE-IND) + 48.32) * HLD-UNITS3.      03640000
047600                                                                  03650000
047700     IF HLD-REV4  = '0656'                                        03660000
047800        COMPUTE WRK-PAY-RATE4 ROUNDED =                           03670000
047900         ((289.99 * HLD-PROV-WAGE-IND) + 163.05) * HLD-UNITS4.    03680000
048000                                                                  03690000
048100     COMPUTE HLD-PAY-AMT =                                        03700000
048200             WRK-PAY-RATE1 +                                      03710000
048300             WRK-PAY-RATE2 +                                      03720000
048400             WRK-PAY-RATE3 +                                      03730000
048500             WRK-PAY-RATE4.                                       03740000
048600                                                                  03750000
048700     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   03760000
048800     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   03770000
048900     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   03780000
049000     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   03790000
049100                                                                  03800000
049200                                                                  03810000
049300     MOVE ZEROES TO WRK-PAY-RATE1                                 03820000
049400                     WRK-PAY-RATE2                                03830000
049500                     WRK-PAY-RATE3                                03840000
049600                     WRK-PAY-RATE4.                               03850000
049700                                                                  03860000
049800 2001-EXIT.  EXIT.                                                03870000
049900                                                                  03880000
050000*----------------------------------------------------------****   03890000
050100*  FY 2001-A PROCESS                                              03891000
050200*----------------------------------------------------------****   03892000
050300                                                                  03893000
050400 2001A-PROCESS-DATA.                                              03894000
050500     IF HLD-UNITS1 > 1000 OR                                      03895000
050600        HLD-UNITS2 > 1000 OR                                      03896000
050700        HLD-UNITS3 > 1000 OR                                      03897000
050800        HLD-UNITS4 > 1000                                         03898000
050900        MOVE '10' TO HLD-RTC                                      03899000
051000        GO TO 2001A-EXIT.                                         03900000
051100                                                                  03910000
051200     IF HLD-REV2  = '0652'                                        03920000
051300        IF HLD-UNITS2 < 8                                         03930000
051400           MOVE '20' TO HLD-RTC                                   03940000
051500           GO TO 2001A-EXIT.                                      03950000
051600                                                                  03960000
051700****    CALCULATE HOME RATE BY REVENUE CODE                       03970000
051800****    CALCULATE HOME RATE BY REVENUE CODE                       03980000
051900                                                                  03990000
052000     IF HLD-REV1  = '0651'                                        04000000
052100        COMPUTE WRK-PAY-RATE1 ROUNDED =                           04010000
052200         ((73.47 * HLD-BENE-WAGE-IND) + 33.46) * HLD-UNITS1.      04020000
052300                                                                  04030000
052400     IF HLD-REV2  = '0652'                                        04040000
052500        COMPUTE WRK-PAY-RATE2 ROUNDED =                           04050000
052600         (((428.84 * HLD-BENE-WAGE-IND)                           04060000
052700                                   + 195.29) / 24) * HLD-UNITS2.  04070000
052800                                                                  04080000
052900     IF HLD-REV3  = '0655'                                        04090000
053000        COMPUTE WRK-PAY-RATE3 ROUNDED =                           04100000
053100         ((59.88 * HLD-PROV-WAGE-IND) + 50.74) * HLD-UNITS3.      04110000
053200                                                                  04120000
053300     IF HLD-REV4  = '0656'                                        04130000
053400        COMPUTE WRK-PAY-RATE4 ROUNDED =                           04140000
053500         ((304.49 * HLD-PROV-WAGE-IND) + 171.20) * HLD-UNITS4.    04150000
053600                                                                  04160000
053700     COMPUTE HLD-PAY-AMT =                                        04170000
053800             WRK-PAY-RATE1 +                                      04180000
053900             WRK-PAY-RATE2 +                                      04190000
054000             WRK-PAY-RATE3 +                                      04200000
054100             WRK-PAY-RATE4.                                       04210000
054200                                                                  04220000
054300     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   04230000
054400     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   04240000
054500     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   04250000
054600     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   04260000
054700                                                                  04270000
054800                                                                  04280000
054900     MOVE ZEROES TO WRK-PAY-RATE1                                 04290000
055000                     WRK-PAY-RATE2                                04300000
055100                     WRK-PAY-RATE3                                04310000
055200                     WRK-PAY-RATE4.                               04320000
055300                                                                  04330000
055400 2001A-EXIT.  EXIT.                                               04340000
055500                                                                  04350000
055600*----------------------------------------------------------****   04360000
055700*  FY 2002 PROCESS                                                04370000
055800*----------------------------------------------------------****   04380000
055900                                                                  04390000
056000 2002-PROCESS-DATA.                                               04400000
056100     IF HLD-UNITS1 > 1000 OR                                      04401000
056200        HLD-UNITS2 > 1000 OR                                      04402000
056300        HLD-UNITS3 > 1000 OR                                      04403000
056400        HLD-UNITS4 > 1000                                         04404000
056500        MOVE '10' TO HLD-RTC                                      04405000
056600        GO TO 2002-EXIT.                                          04406000
056700                                                                  04407000
056800     IF HLD-REV2  = '0652'                                        04408000
056900        IF HLD-UNITS2 < 8                                         04409000
057000           MOVE '20' TO HLD-RTC                                   04410000
057100           GO TO 2002-EXIT.                                       04420000
057200                                                                  04430000
057300****    CALCULATE HOME RATE BY REVENUE CODE                       04440000
057400****    CALCULATE HOME RATE BY REVENUE CODE                       04450000
057500                                                                  04460000
057600     IF HLD-REV1  = '0651'                                        04470000
057700        COMPUTE WRK-PAY-RATE1 ROUNDED =                           04480000
057800         ((75.87 * HLD-BENE-WAGE-IND) + 34.55) * HLD-UNITS1.      04490000
057900                                                                  04500000
058000     IF HLD-REV2  = '0652'                                        04510000
058100        COMPUTE WRK-PAY-RATE2 ROUNDED =                           04520000
058200         (((442.80 * HLD-BENE-WAGE-IND)                           04530000
058300                                   + 201.65) / 24) * HLD-UNITS2.  04540000
058400                                                                  04550000
058500     IF HLD-REV3  = '0655'                                        04560000
058600        COMPUTE WRK-PAY-RATE3 ROUNDED =                           04570000
058700         ((61.83 * HLD-PROV-WAGE-IND) + 52.39) * HLD-UNITS3.      04580000
058800                                                                  04590000
058900     IF HLD-REV4  = '0656'                                        04600000
059000        COMPUTE WRK-PAY-RATE4 ROUNDED =                           04610000
059100         ((314.41 * HLD-PROV-WAGE-IND) + 176.78) * HLD-UNITS4.    04620000
059200                                                                  04630000
059300     COMPUTE HLD-PAY-AMT =                                        04640000
059400             WRK-PAY-RATE1 +                                      04650000
059500             WRK-PAY-RATE2 +                                      04660000
059600             WRK-PAY-RATE3 +                                      04670000
059700             WRK-PAY-RATE4.                                       04680000
059800                                                                  04690000
059900     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   04700000
060000     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   04710000
060100     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   04720000
060200     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   04730000
060300                                                                  04740000
060400                                                                  04750000
060500     MOVE ZEROES TO WRK-PAY-RATE1                                 04760000
060600                     WRK-PAY-RATE2                                04770000
060700                     WRK-PAY-RATE3                                04780000
060800                     WRK-PAY-RATE4.                               04790000
060900                                                                  04800000
061000 2002-EXIT.  EXIT.                                                04810000
061100                                                                  04820000
061200*----------------------------------------------------------****   04830000
061300*  FY 2003 PROCESS                                                04840000
061400*----------------------------------------------------------****   04850000
061500                                                                  04860000
061600 2003-PROCESS-DATA.                                               04870000
061700     IF HLD-UNITS1 > 1000 OR                                      04880000
061800        HLD-UNITS2 > 1000 OR                                      04890000
061900        HLD-UNITS3 > 1000 OR                                      04900000
062000        HLD-UNITS4 > 1000                                         04910000
062100        MOVE '10' TO HLD-RTC                                      04920000
062200        GO TO 2003-EXIT.                                          04930000
062300                                                                  04940000
062400     IF HLD-REV2  = '0652'                                        04950000
062500        IF HLD-UNITS2 < 8                                         04960000
062600           MOVE '20' TO HLD-RTC                                   04970000
062700           GO TO 2003-EXIT.                                       04980000
062800                                                                  04990000
062900****    CALCULATE HOME RATE BY REVENUE CODE                       05000000
063000****    CALCULATE HOME RATE BY REVENUE CODE                       05010000
063100                                                                  05020000
063200     IF HLD-REV1  = '0651'                                        05030000
063300        COMPUTE WRK-PAY-RATE1 ROUNDED =                           05040000
063400         ((78.47 * HLD-BENE-WAGE-IND) + 35.73) * HLD-UNITS1.      05050000
063500                                                                  05060000
063600     IF HLD-REV2  = '0652'                                        05070000
063700        COMPUTE WRK-PAY-RATE2 ROUNDED =                           05080000
063800         (((457.97 * HLD-BENE-WAGE-IND)                           05090000
063900                                   + 208.55) / 24) * HLD-UNITS2.  05100000
064000                                                                  05110000
064100     IF HLD-REV3  = '0655'                                        05120000
064200        COMPUTE WRK-PAY-RATE3 ROUNDED =                           05130000
064300         ((63.94 * HLD-PROV-WAGE-IND) + 54.19) * HLD-UNITS3.      05140000
064400                                                                  05150000
064500     IF HLD-REV4  = '0656'                                        05160000
064600        COMPUTE WRK-PAY-RATE4 ROUNDED =                           05170000
064700         ((325.18 * HLD-PROV-WAGE-IND) + 182.83) * HLD-UNITS4.    05180000
064800                                                                  05190000
064900     COMPUTE HLD-PAY-AMT =                                        05200000
065000             WRK-PAY-RATE1 +                                      05210000
065100             WRK-PAY-RATE2 +                                      05220000
065200             WRK-PAY-RATE3 +                                      05230000
065300             WRK-PAY-RATE4.                                       05240000
065400                                                                  05250000
065500     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   05260000
065600     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   05270000
065700     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   05280000
065800     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   05290000
065900                                                                  05300000
066000                                                                  05310000
066100     MOVE ZEROES TO WRK-PAY-RATE1                                 05320000
066200                     WRK-PAY-RATE2                                05330000
066300                     WRK-PAY-RATE3                                05340000
066400                     WRK-PAY-RATE4.                               05350000
066500                                                                  05360000
066600 2003-EXIT.  EXIT.                                                05370000
066700                                                                  05380000
066800*----------------------------------------------------------****   05390000
066900*  FY 2004 PROCESS                                                05400000
067000*----------------------------------------------------------****   05410000
067100                                                                  05420000
067200 2004-PROCESS-DATA.                                               05421000
067300     IF HLD-UNITS1 > 1000 OR                                      05422000
067400        HLD-UNITS2 > 1000 OR                                      05423000
067500        HLD-UNITS3 > 1000 OR                                      05424000
067600        HLD-UNITS4 > 1000                                         05425000
067700        MOVE '10' TO HLD-RTC                                      05426000
067800        GO TO 2004-EXIT.                                          05427000
067900                                                                  05428000
068000     IF HLD-REV2  = '0652'                                        05429000
068100        IF HLD-UNITS2 < 8                                         05430000
068200           MOVE '20' TO HLD-RTC                                   05440000
068300           GO TO 2004-EXIT.                                       05450000
068400                                                                  05460000
068500****    CALCULATE HOME RATE BY REVENUE CODE                       05470000
068600****    CALCULATE HOME RATE BY REVENUE CODE                       05480000
068700                                                                  05490000
068800     IF HLD-REV1  = '0651'                                        05500000
068900        COMPUTE WRK-PAY-RATE1 ROUNDED =                           05510000
069000         ((81.13 * HLD-BENE-WAGE-IND) + 36.95) * HLD-UNITS1.      05520000
069100                                                                  05530000
069200     IF HLD-REV2  = '0652'                                        05540000
069300        COMPUTE WRK-PAY-RATE2 ROUNDED =                           05550000
069400         (((473.54 * HLD-BENE-WAGE-IND)                           05560000
069500                                   + 215.64) / 24) * HLD-UNITS2.  05570000
069600                                                                  05580000
069700     IF HLD-REV3  = '0655'                                        05590000
069800        COMPUTE WRK-PAY-RATE3 ROUNDED =                           05600000
069900         ((66.12 * HLD-PROV-WAGE-IND) + 56.03) * HLD-UNITS3.      05610000
070000                                                                  05620000
070100     IF HLD-REV4  = '0656'                                        05630000
070200        COMPUTE WRK-PAY-RATE4 ROUNDED =                           05640000
070300         ((336.23 * HLD-PROV-WAGE-IND) + 189.05) * HLD-UNITS4.    05650000
070400                                                                  05660000
070500     COMPUTE HLD-PAY-AMT =                                        05670000
070600             WRK-PAY-RATE1 +                                      05680000
070700             WRK-PAY-RATE2 +                                      05690000
070800             WRK-PAY-RATE3 +                                      05700000
070900             WRK-PAY-RATE4.                                       05710000
071000                                                                  05720000
071100     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   05730000
071200     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   05740000
071300     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   05750000
071400     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   05760000
071500                                                                  05770000
071600                                                                  05780000
071700     MOVE ZEROES TO WRK-PAY-RATE1                                 05790000
071800                     WRK-PAY-RATE2                                05800000
071900                     WRK-PAY-RATE3                                05810000
072000                     WRK-PAY-RATE4.                               05820000
072100                                                                  05830000
072200 2004-EXIT.  EXIT.                                                05840000
072300                                                                  05850000
072400*----------------------------------------------------------****   05860000
072500*  FY 2005 PROCESS                                                05870000
072600*----------------------------------------------------------****   05880000
072700                                                                  05890000
072800 2005-PROCESS-DATA.                                               05900000
072900     IF HLD-UNITS1 > 1000 OR                                      05910000
073000        HLD-UNITS2 > 1000 OR                                      05920000
073100        HLD-UNITS3 > 1000 OR                                      05930000
073200        HLD-UNITS4 > 1000                                         05940000
073300        MOVE '10' TO HLD-RTC                                      05950000
073400        GO TO 2005-EXIT.                                          05960000
073500                                                                  05970000
073600     IF HLD-REV2  = '0652'                                        05980000
073700        IF HLD-UNITS2 < 8                                         05990000
073800           MOVE '20' TO HLD-RTC                                   06000000
073900           GO TO 2005-EXIT.                                       06010000
074000                                                                  06020000
074100****    CALCULATE HOME RATE BY REVENUE CODE                       06030000
074200****    CALCULATE HOME RATE BY REVENUE CODE                       06040000
074300                                                                  06050000
074400     IF HLD-REV1  = '0651'                                        06060000
074500        COMPUTE WRK-PAY-RATE1 ROUNDED =                           06070000
074600         ((83.81 * HLD-BENE-WAGE-IND) + 38.17) * HLD-UNITS1.      06080000
074700                                                                  06090000
074800     IF HLD-REV2  = '0652'                                        06100000
074900        COMPUTE WRK-PAY-RATE2 ROUNDED =                           06110000
075000         (((489.16 * HLD-BENE-WAGE-IND)                           06120000
075100                                   + 222.76) / 24) * HLD-UNITS2.  06130000
075200                                                                  06140000
075300     IF HLD-REV3  = '0655'                                        06150000
075400        COMPUTE WRK-PAY-RATE3 ROUNDED =                           06160000
075500         ((68.30 * HLD-PROV-WAGE-IND) + 57.88) * HLD-UNITS3.      06170000
075600                                                                  06180000
075700     IF HLD-REV4  = '0656'                                        06190000
075800        COMPUTE WRK-PAY-RATE4 ROUNDED =                           06200000
075900         ((347.32 * HLD-PROV-WAGE-IND) + 195.29) * HLD-UNITS4.    06210000
076000                                                                  06220000
076100     COMPUTE HLD-PAY-AMT =                                        06230000
076200             WRK-PAY-RATE1 +                                      06240000
076300             WRK-PAY-RATE2 +                                      06250000
076400             WRK-PAY-RATE3 +                                      06260000
076500             WRK-PAY-RATE4.                                       06270000
076600                                                                  06280000
076700     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   06290000
076800     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   06300000
076900     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   06310000
077000     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   06320000
077100                                                                  06330000
077200                                                                  06340000
077300     MOVE ZEROES TO WRK-PAY-RATE1                                 06350000
077400                     WRK-PAY-RATE2                                06360000
077500                     WRK-PAY-RATE3                                06370000
077600                     WRK-PAY-RATE4.                               06380000
077700                                                                  06390000
077800 2005-EXIT.  EXIT.                                                06400000
077900                                                                  06410000
078000*----------------------------------------------------------****   06420000
078100*  FY 2006 PROCESS                                                06430000
078200*----------------------------------------------------------****   06440000
078300                                                                  06441000
078400 2006-PROCESS-DATA.                                               06442000
078500     IF HLD-UNITS1 > 1000 OR                                      06443000
078600        HLD-UNITS2 > 1000 OR                                      06444000
078700        HLD-UNITS3 > 1000 OR                                      06445000
078800        HLD-UNITS4 > 1000                                         06446000
078900        MOVE '10' TO HLD-RTC                                      06447000
079000        GO TO 2006-EXIT.                                          06448000
079100                                                                  06449000
079200     IF HLD-REV2  = '0652'                                        06450000
079300        IF HLD-UNITS2 < 8                                         06460000
079400           MOVE '20' TO HLD-RTC                                   06470000
079500           GO TO 2006-EXIT.                                       06480000
079600                                                                  06490000
079700****    CALCULATE HOME RATE BY REVENUE CODE                       06500000
079800****    CALCULATE HOME RATE BY REVENUE CODE                       06510000
079900                                                                  06520000
080000     IF HLD-REV1  = '0651'                                        06530000
080100        COMPUTE WRK-PAY-RATE1 ROUNDED =                           06540000
080200         ((86.91 * HLD-BENE-WAGE-IND) + 39.58) * HLD-UNITS1.      06550000
080300                                                                  06560000
080400     IF HLD-REV2  = '0652'                                        06570000
080500        COMPUTE WRK-PAY-RATE2 ROUNDED =                           06580000
080600         (((507.26 * HLD-BENE-WAGE-IND)                           06590000
080700                                   + 231.00) / 24) * HLD-UNITS2.  06600000
080800                                                                  06610000
080900     IF HLD-REV3  = '0655'                                        06620000
081000        COMPUTE WRK-PAY-RATE3 ROUNDED =                           06630000
081100         ((70.83 * HLD-PROV-WAGE-IND) + 60.02) * HLD-UNITS3.      06640000
081200                                                                  06650000
081300     IF HLD-REV4  = '0656'                                        06660000
081400        COMPUTE WRK-PAY-RATE4 ROUNDED =                           06670000
081500         ((360.18 * HLD-PROV-WAGE-IND) + 202.51) * HLD-UNITS4.    06680000
081600                                                                  06690000
081700     COMPUTE HLD-PAY-AMT =                                        06700000
081800             WRK-PAY-RATE1 +                                      06710000
081900             WRK-PAY-RATE2 +                                      06720000
082000             WRK-PAY-RATE3 +                                      06730000
082100             WRK-PAY-RATE4.                                       06740000
082200                                                                  06750000
082300     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   06760000
082400     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   06770000
082500     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   06780000
082600     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   06790000
082700                                                                  06800000
082800                                                                  06810000
082900     MOVE ZEROES TO WRK-PAY-RATE1                                 06820000
083000                     WRK-PAY-RATE2                                06830000
083100                     WRK-PAY-RATE3                                06840000
083200                     WRK-PAY-RATE4.                               06850000
083300                                                                  06860000
083400 2006-EXIT.  EXIT.                                                06870000
083500                                                                  06880000
083600*----------------------------------------------------------****   06890000
083700*  FY 2007 PROCESS                                                06900000
083800*----------------------------------------------------------****   06910000
083900                                                                  06920000
084000 2007-PROCESS-DATA.                                               06930000
084100     IF HLD-UNITS1 > 1000 OR                                      06940000
084200        HLD-UNITS2 > 1000 OR                                      06950000
084300        HLD-UNITS3 > 1000 OR                                      06960000
084400        HLD-UNITS4 > 1000                                         06970000
084500        MOVE '10' TO HLD-RTC                                      06980000
084600        GO TO 2007-EXIT.                                          06990000
084700                                                                  07000000
084800     IF HLD-REV2  = '0652'                                        07010000
084900        IF HLD-UNITS2 < 8                                         07020000
085000           MOVE '20' TO HLD-RTC                                   07021000
085100           GO TO 2007-EXIT.                                       07022000
085200                                                                  07023000
085300****    CALCULATE HOME RATE BY REVENUE CODE                       07024000
085400****    CALCULATE HOME RATE BY REVENUE CODE                       07025000
085500                                                                  07026000
085600     IF HLD-REV1  = '0651'                                        07027000
085700        COMPUTE WRK-PAY-RATE1 ROUNDED =                           07028000
085800         ((89.87 * HLD-BENE-WAGE-IND) + 40.92) * HLD-UNITS1.      07029000
085900                                                                  07029100
086000     IF HLD-REV2  = '0652'                                        07029200
086100        COMPUTE WRK-PAY-RATE2 ROUNDED =                           07029300
086200         (((524.50 * HLD-BENE-WAGE-IND)                           07029400
086300                                   + 238.86) / 24) * HLD-UNITS2.  07029500
086400                                                                  07029600
086500     IF HLD-REV3  = '0655'                                        07029700
086600        COMPUTE WRK-PAY-RATE3 ROUNDED =                           07029800
086700         ((73.24 * HLD-PROV-WAGE-IND) + 62.06) * HLD-UNITS3.      07029900
086800                                                                  07030000
086900     IF HLD-REV4  = '0656'                                        07031000
087000        COMPUTE WRK-PAY-RATE4 ROUNDED =                           07032000
087100         ((372.42 * HLD-PROV-WAGE-IND) + 209.40) * HLD-UNITS4.    07033000
087200                                                                  07034000
087300     COMPUTE HLD-PAY-AMT =                                        07035000
087400             WRK-PAY-RATE1 +                                      07036000
087500             WRK-PAY-RATE2 +                                      07037000
087600             WRK-PAY-RATE3 +                                      07038000
087700             WRK-PAY-RATE4.                                       07039000
087800                                                                  07039100
087900     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   07039200
088000     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   07039300
088100     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   07039400
088200     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   07039500
088300                                                                  07039600
088400                                                                  07039700
088500     MOVE ZEROES TO WRK-PAY-RATE1                                 07039800
088600                     WRK-PAY-RATE2                                07039900
088700                     WRK-PAY-RATE3                                07040000
088800                     WRK-PAY-RATE4.                               07041000
088900                                                                  07042000
089000 2007-EXIT.  EXIT.                                                07043000
089100                                                                  07044000
089200*----------------------------------------------------------****   07045000
089300*  FY 2007-1 PROCESS                                              07046000
089400*----------------------------------------------------------****   07047000
089500                                                                  07048000
089600 2007-1-PROCESS-DATA.                                             07049000
089700     IF HLD-UNITS1 > 1000 OR                                      07049100
089800        HLD-UNITS2 > 1000 OR                                      07049200
089900        HLD-UNITS3 > 1000 OR                                      07049300
090000        HLD-UNITS4 > 1000                                         07049400
090100        MOVE '10' TO HLD-RTC                                      07049500
090200        GO TO 2007-1-EXIT.                                        07049604
090300                                                                  07049700
090400****    CALCULATE HOME RATE BY REVENUE CODE                       07049800
090500****    CALCULATE HOME RATE BY REVENUE CODE                       07049900
090600                                                                  07050000
090700     IF HLD-REV1  = '0651'                                        07051000
090800        COMPUTE WRK-PAY-RATE1 ROUNDED =                           07051100
090900            ((89.87 * HLD-BENE-WAGE-IND) + 40.92) * HLD-UNITS1.   07051200
091000                                                                  07051300
091100     IF HLD-REV2  = '0652'                                        07051400
091200        IF HLD-UNITS2 > 0                                         07051500
091300           IF HLD-UNITS2 < 32                                     07051600
091400             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07051700
091500               ((89.87 * HLD-BENE-WAGE-IND) + 40.92)              07051800
091600           ELSE                                                   07051900
091700             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07052000
091800               (((524.50 * HLD-BENE-WAGE-IND)                     07052100
091900                      + 238.86) / 24) * (HLD-UNITS2 / 4).         07052200
092000                                                                  07052300
092100     IF HLD-REV3  = '0655'                                        07052400
092200        COMPUTE WRK-PAY-RATE3 ROUNDED =                           07052500
092300            ((73.24 * HLD-PROV-WAGE-IND) + 62.06) * HLD-UNITS3.   07052600
092400                                                                  07052700
092500     IF HLD-REV4  = '0656'                                        07052800
092600        COMPUTE WRK-PAY-RATE4 ROUNDED =                           07052900
092700            ((372.42 * HLD-PROV-WAGE-IND) + 209.40) * HLD-UNITS4. 07053000
092800                                                                  07053100
092900     COMPUTE HLD-PAY-AMT =                                        07053200
093000             WRK-PAY-RATE1 +                                      07053300
093100             WRK-PAY-RATE2 +                                      07053400
093200             WRK-PAY-RATE3 +                                      07053500
093300             WRK-PAY-RATE4.                                       07053600
093400                                                                  07053700
093500     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   07053800
093600     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   07053900
093700     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   07054000
093800     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   07054100
093900                                                                  07054200
094000                                                                  07054300
094100     MOVE ZEROES TO WRK-PAY-RATE1                                 07054400
094200                     WRK-PAY-RATE2                                07054500
094300                     WRK-PAY-RATE3                                07054600
094400                     WRK-PAY-RATE4.                               07054700
094500                                                                  07054800
094600 2007-1-EXIT. EXIT.                                               07054900
094700*----------------------------------------------------------****   07055000
094800*----------------------------------------------------------****   07055100
094900*  FY 2008 PROCESS                                                07055200
095000*----------------------------------------------------------****   07055300
095100                                                                  07055400
095200 2008-PROCESS-DATA.                                               07055500
095300     IF HLD-UNITS1 > 1000 OR                                      07055600
095400        HLD-UNITS2 > 1000 OR                                      07055700
095500        HLD-UNITS3 > 1000 OR                                      07055800
095600        HLD-UNITS4 > 1000                                         07055900
095700        MOVE '10' TO HLD-RTC                                      07056000
095800        GO TO 2008-EXIT.                                          07056104
095900                                                                  07056200
096000****    CALCULATE HOME RATE BY REVENUE CODE                       07056300
096100****    CALCULATE HOME RATE BY REVENUE CODE                       07056400
096200                                                                  07056500
096300     IF HLD-REV1  = '0651'                                        07056600
096400        COMPUTE WRK-PAY-RATE1 ROUNDED =                           07056700
096500            ((92.83 * HLD-BENE-WAGE-IND) + 42.28) * HLD-UNITS1.   07056800
096600                                                                  07056900
096700     IF HLD-REV2  = '0652'                                        07057000
096800        IF HLD-UNITS2 > 0                                         07057100
096900           IF HLD-UNITS2 < 32                                     07057200
097000             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07057300
097100               ((92.83 * HLD-BENE-WAGE-IND) + 42.28)              07057400
097200           ELSE                                                   07057500
097300             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07057600
097400               (((541.81 * HLD-BENE-WAGE-IND)                     07057700
097500                      + 246.74) / 24) * (HLD-UNITS2 / 4).         07057800
097600                                                                  07057900
097700     IF HLD-REV3  = '0655'                                        07058000
097800        COMPUTE WRK-PAY-RATE3 ROUNDED =                           07058100
097900            ((75.65 * HLD-PROV-WAGE-IND) + 64.11) * HLD-UNITS3.   07058200
098000                                                                  07058300
098100     IF HLD-REV4  = '0656'                                        07058400
098200        COMPUTE WRK-PAY-RATE4 ROUNDED =                           07058500
098300            ((384.71 * HLD-PROV-WAGE-IND) + 216.31) * HLD-UNITS4. 07058600
098400                                                                  07058700
098500     COMPUTE HLD-PAY-AMT =                                        07058800
098600             WRK-PAY-RATE1 +                                      07058900
098700             WRK-PAY-RATE2 +                                      07059000
098800             WRK-PAY-RATE3 +                                      07059100
098900             WRK-PAY-RATE4.                                       07059200
099000                                                                  07059300
099100     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   07059400
099200     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   07059500
099300     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   07059600
099400     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   07059700
099500                                                                  07059800
099600                                                                  07059900
099700     MOVE ZEROES TO WRK-PAY-RATE1                                 07060000
099800                     WRK-PAY-RATE2                                07061000
099900                     WRK-PAY-RATE3                                07062000
100000                     WRK-PAY-RATE4.                               07063000
100100                                                                  07064000
100200 2008-EXIT. EXIT.                                                 07065000
100300*----------------------------------------------------------****   07066000
100400*----------------------------------------------------------****   07066101
100500*  FY 2009 PROCESS                                                07066201
100600*----------------------------------------------------------****   07066301
100700                                                                  07066401
100800 2009-PROCESS-DATA.                                               07066501
100900     IF HLD-UNITS1 > 1000 OR                                      07066601
101000        HLD-UNITS2 > 1000 OR                                      07066701
101100        HLD-UNITS3 > 1000 OR                                      07066801
101200        HLD-UNITS4 > 1000                                         07066901
101300        MOVE '10' TO HLD-RTC                                      07067001
101400        GO TO 2009-EXIT.                                          07067104
101500                                                                  07067201
101600****    CALCULATE HOME RATE BY REVENUE CODE                       07067301
101700****    CALCULATE HOME RATE BY REVENUE CODE                       07067401
101800                                                                  07067501
101900     IF HLD-REV1  = '0651'                                        07067601
102000        COMPUTE WRK-PAY-RATE1 ROUNDED =                           07067701
102100            ((96.17 * HLD-BENE-WAGE-IND) + 43.80) * HLD-UNITS1.   07067803
102200                                                                  07067901
102300     IF HLD-REV2  = '0652'                                        07068001
102400        IF HLD-UNITS2 > 0                                         07068101
102500           IF HLD-UNITS2 < 32                                     07068201
102600             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068301
102700               ((96.17 * HLD-BENE-WAGE-IND) + 43.80)              07068403
102800           ELSE                                                   07068501
102900             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068601
103000               (((561.32 * HLD-BENE-WAGE-IND)                     07068703
103100                      + 255.62) / 24) * (HLD-UNITS2 / 4).         07068803
103200                                                                  07068901
103300     IF HLD-REV3  = '0655'                                        07069001
103400        COMPUTE WRK-PAY-RATE3 ROUNDED =                           07069101
103500            ((78.37 * HLD-PROV-WAGE-IND) + 66.42) * HLD-UNITS3.   07069203
103600                                                                  07069301
103700     IF HLD-REV4  = '0656'                                        07069401
103800        COMPUTE WRK-PAY-RATE4 ROUNDED =                           07069501
103900            ((398.56 * HLD-PROV-WAGE-IND) + 224.10) * HLD-UNITS4. 07069603
104000                                                                  07069701
104100     COMPUTE HLD-PAY-AMT =                                        07069801
104200             WRK-PAY-RATE1 +                                      07069901
104300             WRK-PAY-RATE2 +                                      07070001
104400             WRK-PAY-RATE3 +                                      07071001
104500             WRK-PAY-RATE4.                                       07072001
104600                                                                  07073001
104700     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   07074001
104800     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   07075001
104900     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   07076001
105000     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   07077001
105100                                                                  07078001
105200                                                                  07079001
105300     MOVE ZEROES TO WRK-PAY-RATE1                                 07079101
105400                     WRK-PAY-RATE2                                07079201
105500                     WRK-PAY-RATE3                                07079301
105600                     WRK-PAY-RATE4.                               07079401
105700                                                                  07079501
105800 2009-EXIT. EXIT.                                                 07079601
105900*----------------------------------------------------------****   07066000
106000*----------------------------------------------------------****   07066101
106100*  FY 2010 PROCESS                                                07066201
106200*----------------------------------------------------------****   07066301
106300                                                                  07066401
106400 2010-PROCESS-DATA.                                               07066501
106500     IF HLD-UNITS1 > 1000 OR                                      07066601
106600        HLD-UNITS2 > 1000 OR                                      07066701
106700        HLD-UNITS3 > 1000 OR                                      07066801
106800        HLD-UNITS4 > 1000                                         07066901
106900        MOVE '10' TO HLD-RTC                                      07067001
107000        GO TO 2010-EXIT.                                          07067104
107100                                                                  07067201
107200****    CALCULATE HOME RATE BY REVENUE CODE                       07067301
107300****    CALCULATE HOME RATE BY REVENUE CODE                       07067401
107400                                                                  07067501
107500     IF HLD-REV1  = '0651'                                        07067601
107600        COMPUTE WRK-PAY-RATE1 ROUNDED =                           07067701
107700            ((98.19 * HLD-BENE-WAGE-IND) + 44.72) * HLD-UNITS1.   07067803
107800                                                                  07067901
107900     IF HLD-REV2  = '0652'                                        07068001
108000        IF HLD-UNITS2 > 0                                         07068101
108100           IF HLD-UNITS2 < 32                                     07068201
108200             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068301
108300               ((98.19 * HLD-BENE-WAGE-IND) + 44.72)              07068403
108400           ELSE                                                   07068501
108500             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068601
108600               (((573.11 * HLD-BENE-WAGE-IND)                     07068703
108700                      + 260.99) / 24) * (HLD-UNITS2 / 4).         07068803
108800                                                                  07068901
108900     IF HLD-REV3  = '0655'                                        07069001
109000        COMPUTE WRK-PAY-RATE3 ROUNDED =                           07069101
109100            ((80.02 * HLD-PROV-WAGE-IND) + 67.81) * HLD-UNITS3.   07069203
109200                                                                  07069301
109300     IF HLD-REV4  = '0656'                                        07069401
109400        COMPUTE WRK-PAY-RATE4 ROUNDED =                           07069501
109500            ((406.94 * HLD-PROV-WAGE-IND) + 228.80) * HLD-UNITS4. 07069603
109600                                                                  07069701
109700     COMPUTE HLD-PAY-AMT =                                        07069801
109800             WRK-PAY-RATE1 +                                      07069901
109900             WRK-PAY-RATE2 +                                      07070001
110000             WRK-PAY-RATE3 +                                      07071001
110100             WRK-PAY-RATE4.                                       07072001
110200                                                                  07073001
110300     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   07074001
110400     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   07075001
110500     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   07076001
110600     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   07077001
110700                                                                  07078001
110800                                                                  07079001
110900     MOVE ZEROES TO WRK-PAY-RATE1                                 07079101
111000                     WRK-PAY-RATE2                                07079201
111100                     WRK-PAY-RATE3                                07079301
111200                     WRK-PAY-RATE4.                               07079401
111300                                                                  07079501
111400 2010-EXIT. EXIT.                                                 07079601
106000*----------------------------------------------------------****   07066101
106100*  FY 2011 PROCESS                                                07066201
106200*----------------------------------------------------------****   07066301
106300                                                                  07066401
106400 2011-PROCESS-DATA.                                               07066501
106500     IF HLD-UNITS1 > 1000 OR                                      07066601
106600        HLD-UNITS2 > 1000 OR                                      07066701
106700        HLD-UNITS3 > 1000 OR                                      07066801
106800        HLD-UNITS4 > 1000                                         07066901
106900        MOVE '10' TO HLD-RTC                                      07067001
107000        GO TO 2011-EXIT.                                          07067104
107100                                                                  07067201
107200****    CALCULATE HOME RATE BY REVENUE CODE                       07067301
107300****    CALCULATE HOME RATE BY REVENUE CODE                       07067401
107400                                                                  07067501
107500     IF HLD-REV1  = '0651'                                        07067601
107600        COMPUTE WRK-PAY-RATE1 ROUNDED =                           07067701
107700            ((100.75 * HLD-BENE-WAGE-IND) + 45.88) * HLD-UNITS1.  07067803
107800                                                                  07067901
107900     IF HLD-REV2  = '0652'                                        07068001
108000        IF HLD-UNITS2 > 0                                         07068101
108100           IF HLD-UNITS2 < 32                                     07068201
108200             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068301
108300               ((100.75 * HLD-BENE-WAGE-IND) + 45.88)             07068403
108400           ELSE                                                   07068501
108500             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068601
108600               (((588.01 * HLD-BENE-WAGE-IND)                     07068703
108700                      + 267.78) / 24) * (HLD-UNITS2 / 4).         07068803
108800                                                                  07068901
108900     IF HLD-REV3  = '0655'                                        07069001
109000        COMPUTE WRK-PAY-RATE3 ROUNDED =                           07069101
109100            ((82.10 * HLD-PROV-WAGE-IND) + 69.57) * HLD-UNITS3.   07069203
109200                                                                  07069301
109300     IF HLD-REV4  = '0656'                                        07069401
109400        COMPUTE WRK-PAY-RATE4 ROUNDED =                           07069501
109500            ((417.52 * HLD-PROV-WAGE-IND) + 234.75) * HLD-UNITS4. 07069603
109600                                                                  07069701
109700     COMPUTE HLD-PAY-AMT =                                        07069801
109800             WRK-PAY-RATE1 +                                      07069901
109900             WRK-PAY-RATE2 +                                      07070001
110000             WRK-PAY-RATE3 +                                      07071001
110100             WRK-PAY-RATE4.                                       07072001
110200                                                                  07073001
110300     MOVE WRK-PAY-RATE1 TO  HLD-THEIR-PAY-CHG1.                   07074001
110400     MOVE WRK-PAY-RATE2 TO  HLD-THEIR-PAY-CHG2.                   07075001
110500     MOVE WRK-PAY-RATE3 TO  HLD-THEIR-PAY-CHG3.                   07076001
110600     MOVE WRK-PAY-RATE4 TO  HLD-THEIR-PAY-CHG4.                   07077001
110700                                                                  07078001
110800                                                                  07079001
110900     MOVE ZEROES TO WRK-PAY-RATE1                                 07079101
111000                     WRK-PAY-RATE2                                07079201
111100                     WRK-PAY-RATE3                                07079301
111200                     WRK-PAY-RATE4.                               07079401
111300                                                                  07079501
111400 2011-EXIT. EXIT.                                                 07079601
106300                                                                  07066401
106000*----------------------------------------------------------****   07066101
106100*  FY 2012 PROCESS                                                07066201
106200*----------------------------------------------------------****   07066301
106300                                                                  07066401
106400 2012-PROCESS-DATA.                                               07066501
106500     IF HLD-UNITS1 > 1000 OR                                      07066601
106600        HLD-UNITS2 > 1000 OR                                      07066701
106700        HLD-UNITS3 > 1000 OR                                      07066801
106800        HLD-UNITS4 > 1000                                         07066901
106900        MOVE '10' TO HLD-RTC                                      07067001
107000        GO TO 2012-EXIT.                                          07067104
107100                                                                  07067201
107200****    CALCULATE HOME RATE BY REVENUE CODE                       07067301
107300****    CALCULATE HOME RATE BY REVENUE CODE                       07067401
107400                                                                  07067501
107500     IF HLD-REV1  = '0651'                                        07067601
107600        COMPUTE WRK-PAY-RATE1 ROUNDED =                           07067701
107700            ((103.77 * HLD-BENE-WAGE-IND) + 47.26) * HLD-UNITS1.  07067803
107800                                                                  07067901
107900     IF HLD-REV2  = '0652'                                        07068001
108000        IF HLD-UNITS2 > 0                                         07068101
108100           IF HLD-UNITS2 < 32                                     07068201
108200             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068301
108300               ((103.77 * HLD-BENE-WAGE-IND) + 47.26)             07068403
108400           ELSE                                                   07068501
108500             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068601
108600               (((605.65 * HLD-BENE-WAGE-IND)                     07068703
108700                      + 275.81) / 24) * (HLD-UNITS2 / 4).         07068803
108800                                                                  07068901
108900     IF HLD-REV3  = '0655'                                        07069001
109000        COMPUTE WRK-PAY-RATE3 ROUNDED =                           07069101
109100            ((84.56 * HLD-PROV-WAGE-IND) + 71.66) * HLD-UNITS3.   07069203
109200                                                                  07069301
109300     IF HLD-REV4  = '0656'                                        07069401
109400        COMPUTE WRK-PAY-RATE4 ROUNDED =                           07069501
109500            ((430.04 * HLD-PROV-WAGE-IND) + 241.80) * HLD-UNITS4. 07069603
109600                                                                  07069701
109700     COMPUTE HLD-PAY-AMT =                                        07069801
109800             WRK-PAY-RATE1 +                                      07069901
109900             WRK-PAY-RATE2 +                                      07070001
110000             WRK-PAY-RATE3 +                                      07071001
110100             WRK-PAY-RATE4.                                       07072001
110200                                                                  07073001
110300     MOVE WRK-PAY-RATE1        TO HLD-THEIR-PAY-CHG1.             07074001
110400     MOVE WRK-PAY-RATE2        TO HLD-THEIR-PAY-CHG2.             07075001
110500     MOVE WRK-PAY-RATE3        TO HLD-THEIR-PAY-CHG3.             07076001
110600     MOVE WRK-PAY-RATE4        TO HLD-THEIR-PAY-CHG4.             07077001
110700                                                                  07078001
110800                                                                  07079001
110900     MOVE ZEROES               TO WRK-PAY-RATE1                   07079101
111000                                  WRK-PAY-RATE2                   07079201
111100                                  WRK-PAY-RATE3                   07079301
111200                                  WRK-PAY-RATE4.                  07079401
111300                                                                  07079501
111400 2012-EXIT. EXIT.                                                 07079601
106300                                                                  07066401
106000*----------------------------------------------------------****   07066101
106100*  FY 2013 PROCESS                                                07066201
106200*----------------------------------------------------------****   07066301
106300                                                                  07066401
106400 2013-PROCESS-DATA.                                               07066501
106500     IF HLD-UNITS1 > 1000 OR                                      07066601
106600        HLD-UNITS2 > 1000 OR                                      07066701
106700        HLD-UNITS3 > 1000 OR                                      07066801
106800        HLD-UNITS4 > 1000                                         07066901
106900        MOVE '10' TO HLD-RTC                                      07067001
107000        GO TO 2013-EXIT.                                          07067104
107100                                                                  07067201
107200****    CALCULATE HOME RATE BY REVENUE CODE                       07067301
107300****    CALCULATE HOME RATE BY REVENUE CODE                       07067401
107400                                                                  07067501
107500     IF HLD-REV1  = '0651'                                        07067601
107600        COMPUTE WRK-PAY-RATE1 ROUNDED =                           07067701
107700            ((105.44 * HLD-BENE-WAGE-IND) + 48.01) * HLD-UNITS1.  07067803
107800                                                                  07067901
107900     IF HLD-REV2  = '0652'                                        07068001
108000        IF HLD-UNITS2 > 0                                         07068101
108100           IF HLD-UNITS2 < 32                                     07068201
108200             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068301
108300               ((105.44 * HLD-BENE-WAGE-IND) + 48.01)             07068403
108400           ELSE                                                   07068501
108500             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068601
108600               (((615.34 * HLD-BENE-WAGE-IND)                     07068703
108700                      + 280.22) / 24) * (HLD-UNITS2 / 4).         07068803
108800                                                                  07068901
108900     IF HLD-REV3  = '0655'                                        07069001
109000        COMPUTE WRK-PAY-RATE3 ROUNDED =                           07069101
109100            ((85.92 * HLD-PROV-WAGE-IND) + 72.80) * HLD-UNITS3.   07069203
109200                                                                  07069301
109300     IF HLD-REV4  = '0656'                                        07069401
109400        COMPUTE WRK-PAY-RATE4 ROUNDED =                           07069501
109500            ((436.93 * HLD-PROV-WAGE-IND) + 245.66) * HLD-UNITS4. 07069603
109600                                                                  07069701
109700     COMPUTE HLD-PAY-AMT =                                        07069801
109800             WRK-PAY-RATE1 +                                      07069901
109900             WRK-PAY-RATE2 +                                      07070001
110000             WRK-PAY-RATE3 +                                      07071001
110100             WRK-PAY-RATE4.                                       07072001
110200                                                                  07073001
110300     MOVE WRK-PAY-RATE1        TO  HLD-THEIR-PAY-CHG1.            07074001
110400     MOVE WRK-PAY-RATE2        TO  HLD-THEIR-PAY-CHG2.            07075001
110500     MOVE WRK-PAY-RATE3        TO  HLD-THEIR-PAY-CHG3.            07076001
110600     MOVE WRK-PAY-RATE4        TO HLD-THEIR-PAY-CHG4.             07077001
110700                                                                  07078001
110800                                                                  07079001
110900     MOVE ZEROES               TO WRK-PAY-RATE1                   07079101
111000                                  WRK-PAY-RATE2                   07079201
111100                                  WRK-PAY-RATE3                   07079301
111200                                  WRK-PAY-RATE4.                  07079401
111300                                                                  07079501
111400 2013-EXIT. EXIT.                                                 07079601
106300                                                                  07066401
106000*----------------------------------------------------------****   07066101
106100*  FY 2014 PROCESS                                                07066201
106200*----------------------------------------------------------****   07066301
106300                                                                  07066401
106400 2014-PROCESS-DATA.                                               07066501
106300                                                                  07066401
106500     IF HLD-UNITS1 > 1000 OR                                      07066601
106600        HLD-UNITS2 > 1000 OR                                      07066701
106700        HLD-UNITS3 > 1000 OR                                      07066801
106800        HLD-UNITS4 > 1000                                         07066901
106900        MOVE '10'              TO HLD-RTC                         07067001
107000        GO TO 2014-EXIT.                                          07067104
107100                                                                  07067201
106300                                                                  07066401
106500     IF HLD-QIP-REDUCTION-IND = '1'                               07066601
016200        PERFORM 2014-APPLY-QIP                                    01084001
016200           THRU 2014-QIP-EXIT                                     01084001
016300     ELSE                                                         01085000
016200        PERFORM 2014-APPLY-NO-QIP                                 01084001
016200           THRU 2014-NO-QIP-EXIT.                                 01084001
106600                                                                  07066701
109700     COMPUTE HLD-PAY-AMT =                                        07069801
109800             WRK-PAY-RATE1 +                                      07069901
109900             WRK-PAY-RATE2 +                                      07070001
110000             WRK-PAY-RATE3 +                                      07071001
110100             WRK-PAY-RATE4.                                       07072001
110200                                                                  07073001
107800                                                                  07067901
110300     MOVE WRK-PAY-RATE1        TO  HLD-THEIR-PAY-CHG1.            07074001
110400     MOVE WRK-PAY-RATE2        TO  HLD-THEIR-PAY-CHG2.            07075001
110500     MOVE WRK-PAY-RATE3        TO  HLD-THEIR-PAY-CHG3.            07076001
110600     MOVE WRK-PAY-RATE4        TO  HLD-THEIR-PAY-CHG4.            07077001
110700                                                                  07078001
110800                                                                  07079001
110900     MOVE ZEROES               TO WRK-PAY-RATE1                   07079101
111000                                  WRK-PAY-RATE2                   07079201
111100                                  WRK-PAY-RATE3                   07079301
111200                                  WRK-PAY-RATE4.                  07079401
106300                                                                  07066401
111400 2014-EXIT. EXIT.                                                 07079601
107100                                                                  07067201
106400 2014-APPLY-NO-QIP.                                               07066501
107100                                                                  07067201
107200****    CALCULATE HOME RATE BY REVENUE CODE (NO QIP REDUCTION)    07067301
107200****    CALCULATE HOME RATE BY REVENUE CODE (NO QIP REDUCTION)    07067301
107400                                                                  07067501
107400                                                                  07067501
107500     IF HLD-REV1  = '0651'                                        07067601
107600        COMPUTE WRK-PAY-RATE1 ROUNDED =                           07067701
107700            ((107.23 * HLD-BENE-WAGE-IND) + 48.83) * HLD-UNITS1.  07067803
107800                                                                  07067901
107800                                                                  07067901
107800                                                                  07067901
107800                                                                  07067901
107900     IF HLD-REV2  = '0652'                                        07068001
108000        IF HLD-UNITS2 > 0                                         07068101
108100           IF HLD-UNITS2 < 32                                     07068201
108200             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068301
108300               ((107.23 * HLD-BENE-WAGE-IND) + 48.83)             07068403
108400           ELSE                                                   07068501
108500             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068601
108600               (((625.80 * HLD-BENE-WAGE-IND)                     07068703
108700                      + 284.98) / 24) * (HLD-UNITS2 / 4).         07068803
108800                                                                  07068901
109600                                                                  07069701
108800                                                                  07068901
108900     IF HLD-REV3  = '0655'                                        07069001
109000        COMPUTE WRK-PAY-RATE3 ROUNDED =                           07069101
109100            ((87.38 * HLD-PROV-WAGE-IND) + 74.04) * HLD-UNITS3.   07069203
108800                                                                  07068901
109600                                                                  07069701
108800                                                                  07068901
109200                                                                  07069301
109300     IF HLD-REV4  = '0656'                                        07069401
109400        COMPUTE WRK-PAY-RATE4 ROUNDED =                           07069501
109500            ((444.35 * HLD-PROV-WAGE-IND) + 249.84) * HLD-UNITS4. 07069603
109600                                                                  07069701
111300                                                                  07079501
111400 2014-NO-QIP-EXIT. EXIT.                                          07079601
111400                                                                  07079601
106300                                                                  07066401
106400 2014-APPLY-QIP.                                                  07066501
107100                                                                  07067201
107200****    CALCULATE HOME RATE BY REVENUE CODE (WITH QIP REDUCTION)  07067301
107200****    CALCULATE HOME RATE BY REVENUE CODE (WITH QIP REDUCTION)  07067301
107400                                                                  07067501
107500     IF HLD-REV1  = '0651'                                        07067601
107600        COMPUTE WRK-PAY-RATE1 ROUNDED =                           07067701
107700            ((105.12 * HLD-BENE-WAGE-IND) + 47.87) * HLD-UNITS1.  07067803
107800                                                                  07067901
107900     IF HLD-REV2  = '0652'                                        07068001
108000        IF HLD-UNITS2 > 0                                         07068101
108100           IF HLD-UNITS2 < 32                                     07068201
108200             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068301
108300               ((105.12 * HLD-BENE-WAGE-IND) + 47.87)             07068403
108400           ELSE                                                   07068501
108500             COMPUTE WRK-PAY-RATE2 ROUNDED =                      07068601
108600               (((613.49 * HLD-BENE-WAGE-IND)                     07068703
108700                      + 279.38) / 24) * (HLD-UNITS2 / 4).         07068803
108800                                                                  07068901
108900     IF HLD-REV3  = '0655'                                        07069001
109000        COMPUTE WRK-PAY-RATE3 ROUNDED =                           07069101
109100            ((85.66 * HLD-PROV-WAGE-IND) + 72.58) * HLD-UNITS3.   07069203
109200                                                                  07069301
109300     IF HLD-REV4  = '0656'                                        07069401
109400        COMPUTE WRK-PAY-RATE4 ROUNDED =                           07069501
109500            ((435.61 * HLD-PROV-WAGE-IND) + 244.93) * HLD-UNITS4. 07069603
109600                                                                  07069701
111300                                                                  07079501
111400 2014-QIP-EXIT. EXIT.                                             07079601
111500*----------------------------------------------------------****   07079701
111600******        L A S T   S O U R C E   S T A T E M E N T   *****   07080001
